From 9dda143d656beb45a0568e50d5e73bcc04b366f0 Mon Sep 17 00:00:00 2001
From: Peter Jones <pjones@redhat.com>
Date: Wed, 31 Jan 2024 14:10:03 -0500
Subject: [PATCH] ABI update for newer libabigail

In order to guarantee ABI compatibility with previous versions, efivar
keeps XML descriptions of its ABI in src/libefiboot.abixml,
src/libefisec.abixml, and src/libefivar.abixmlsrc/libefivar.abixml .
For each release, these must be updated to avoid issues with any updates
to the tooling in libabigail.

This commit updates the .abixml files, which have been regenerated at
the efivar 39 tag (c47820c37ac26286559ec004de07d48d05f3308c) using
libabigail-2.5-2.fc41.x86_64, so that the current ABI can be validated
with abidiff against the efivar 39 release.  I'm doing this now because
the format compatibility broke a little bit, and it's breaking rebuilds
in Fedora's Rawhide builds.

Signed-off-by: Peter Jones <pjones@redhat.com>
---
 src/libefiboot.abixml | 1638 ++++++++++++++-------------
 src/libefisec.abixml  |  616 +++++-----
 src/libefivar.abixml  | 2487 ++++++++++++++++++++++-------------------
 3 files changed, 2483 insertions(+), 2258 deletions(-)

diff --git a/src/libefiboot.abixml b/src/libefiboot.abixml
index a1f6fba9e34..7667b572d1a 100644
--- a/src/libefiboot.abixml
+++ b/src/libefiboot.abixml
@@ -1,4 +1,4 @@
-<abi-corpus version='2.1' path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>

+    <elf-symbol name='malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='posix_memalign' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='readdir64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='readlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='sched_yield' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='setmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strcspn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strstr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+  </undefined-elf-function-symbols>
+  <undefined-elf-variable-symbols>
+    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+  </undefined-elf-variable-symbols>
   <abi-instr address-size='64' path='creator.c' comp-dir-path='src' language='LANG_C11'>
     <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-2'>
-      <subrange length='3' type-id='type-id-3' id='type-id-4'/>
+      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' id='type-id-4'/>
     </array-type-def>
     <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
     <type-decl name='char' size-in-bits='8' id='type-id-6'/>
     <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-7'>
-      <subrange length='1' type-id='type-id-3' id='type-id-8'/>
+      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-8'/>
     </array-type-def>
     <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-9'>
-      <subrange length='20' type-id='type-id-3' id='type-id-10'/>
+      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-3' id='type-id-10'/>
     </array-type-def>
     <enum-decl name='interface_type' filepath='src/linux.h' line='94' column='1' id='type-id-11'>
       <underlying-type type-id='type-id-12'/>
@@ -142,7 +231,7 @@
         <var-decl name='_freeres_buf' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1472'>
-        <var-decl name='__pad5' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
+        <var-decl name='_prevchain' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1536'>
         <var-decl name='_mode' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
@@ -493,40 +582,39 @@
         <var-decl name='' type-id='type-id-71' visibility='default'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='DIR' type-id='type-id-72' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-73'/>
-    <typedef-decl name='FILE' type-id='type-id-16' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-74'/>
-    <typedef-decl name='_IO_lock_t' type-id='type-id-75' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-76'/>
+    <typedef-decl name='FILE' type-id='type-id-16' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-72'/>
+    <typedef-decl name='_IO_lock_t' type-id='type-id-73' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-74'/>
     <typedef-decl name='__blkcnt_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-66'/>
     <typedef-decl name='__blksize_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-65'/>
     <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-59'/>
     <typedef-decl name='__gid_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-64'/>
     <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-60'/>
-    <typedef-decl name='__int32_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-77'/>
+    <typedef-decl name='__int32_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-75'/>
     <typedef-decl name='__mode_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-62'/>
     <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-61'/>
     <typedef-decl name='__off64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-23'/>
     <typedef-decl name='__off_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-20'/>
-    <typedef-decl name='__ssize_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-78'/>
+    <typedef-decl name='__ssize_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-76'/>
     <typedef-decl name='__syscall_slong_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-1'/>
     <typedef-decl name='__time_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-68'/>
     <typedef-decl name='__uid_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-63'/>
-    <typedef-decl name='__uint16_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-79'/>
-    <typedef-decl name='__uint32_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-80'/>
-    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-81'/>
-    <typedef-decl name='__uint8_t' type-id='type-id-82' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-83'/>
+    <typedef-decl name='__uint16_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-77'/>
+    <typedef-decl name='__uint32_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-78'/>
+    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-79'/>
+    <typedef-decl name='__uint8_t' type-id='type-id-80' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-81'/>
     <typedef-decl name='efi_guid_t' type-id='type-id-43' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-42'/>
-    <typedef-decl name='int32_t' type-id='type-id-77' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-47'/>
-    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/13/include/stddef.h' line='214' column='1' id='type-id-27'/>
-    <typedef-decl name='ssize_t' type-id='type-id-78' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-84'/>
-    <typedef-decl name='uint16_t' type-id='type-id-79' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-44'/>
-    <typedef-decl name='uint32_t' type-id='type-id-80' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-31'/>
-    <typedef-decl name='uint64_t' type-id='type-id-81' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-32'/>
-    <typedef-decl name='uint8_t' type-id='type-id-83' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-53'/>
+    <typedef-decl name='int32_t' type-id='type-id-75' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-47'/>
+    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/14/include/stddef.h' line='214' column='1' id='type-id-82'/>
+    <typedef-decl name='ssize_t' type-id='type-id-76' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-83'/>
+    <typedef-decl name='uint16_t' type-id='type-id-77' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-44'/>
+    <typedef-decl name='uint32_t' type-id='type-id-78' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-31'/>
+    <typedef-decl name='uint64_t' type-id='type-id-79' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-32'/>
+    <typedef-decl name='uint8_t' type-id='type-id-81' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-53'/>
     <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='48' id='type-id-45'>
-      <subrange length='6' type-id='type-id-3' id='type-id-85'/>
+      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' id='type-id-84'/>
     </array-type-def>
     <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='64' id='type-id-51'>
-      <subrange length='8' type-id='type-id-3' id='type-id-86'/>
+      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' id='type-id-85'/>
     </array-type-def>
     <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='136' column='1' id='type-id-71'>
       <data-member access='public'>
@@ -560,103 +648,94 @@
       </data-member>
     </union-decl>
     <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-12'/>
-    <type-decl name='unsigned char' size-in-bits='8' id='type-id-82'/>
+    <type-decl name='unsigned char' size-in-bits='8' id='type-id-80'/>
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-29'/>
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
     <type-decl name='unsigned short int' size-in-bits='16' id='type-id-21'/>
-    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-87'/>
-    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-88'/>
-    <qualified-type-def type-id='type-id-88' restrict='yes' id='type-id-89'/>
+    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-86'/>
     <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-19'/>
-    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-24'/>
-    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-22'/>
-    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-18'/>
-    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-25'/>
-    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-93'/>
+    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-27'/>
+    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-87'/>
     <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-17'/>
-    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-38'/>
-    <qualified-type-def type-id='type-id-17' restrict='yes' id='type-id-95'/>
-    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-96'/>
-    <qualified-type-def type-id='type-id-96' restrict='yes' id='type-id-97'/>
-    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-98'/>
-    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
-    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-100'/>
-    <qualified-type-def type-id='type-id-99' restrict='yes' id='type-id-101'/>
-    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-102'/>
-    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-40'/>
-    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-103'/>
-    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-104'/>
+    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-38'/>
+    <qualified-type-def type-id='type-id-17' restrict='yes' id='type-id-89'/>
+    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-90'/>
+    <qualified-type-def type-id='type-id-90' restrict='yes' id='type-id-91'/>
+    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-92'/>
+    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
+    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-94'/>
+    <qualified-type-def type-id='type-id-93' restrict='yes' id='type-id-95'/>
+    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-96'/>
+    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-40'/>
+    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-97'/>
+    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-98'/>
     <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-35'/>
-    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-105'/>
+    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-99'/>
     <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-70'/>
-    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-106'/>
-    <qualified-type-def type-id='type-id-106' restrict='yes' id='type-id-107'/>
-    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-36'/>
-    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-37'/>
-    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-110'/>
-    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-26'/>
-    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
-    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-91'/>
-    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-92'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
-    <type-decl name='variadic parameter type' id='type-id-111'/>
-    <type-decl name='void' id='type-id-75'/>
+    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-36'/>
+    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-37'/>
+    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-102'/>
+    <qualified-type-def type-id='type-id-102' restrict='yes' id='type-id-103'/>
+    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-104'/>
+    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
+    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-24'/>
+    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-22'/>
+    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-18'/>
+    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-25'/>
+    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
+      <return type-id='type-id-73'/>
+    </function-decl>
+    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
+      <return type-id='type-id-73'/>
+    </function-decl>
+    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-107'/>
+    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-108'/>
+    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
     <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='318' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='318' column='1'/>
-      <parameter type-id='type-id-99' name='devpath' filepath='src/creator.c' line='319' column='1'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/creator.c' line='318' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/creator.c' line='318' column='1'/>
+      <parameter type-id='type-id-93' name='devpath' filepath='src/creator.c' line='319' column='1'/>
       <parameter type-id='type-id-13' name='partition' filepath='src/creator.c' line='319' column='1'/>
-      <parameter type-id='type-id-99' name='relpath' filepath='src/creator.c' line='320' column='1'/>
+      <parameter type-id='type-id-93' name='relpath' filepath='src/creator.c' line='320' column='1'/>
       <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='321' column='1'/>
       <parameter is-variadic='yes'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='370' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='370' column='1'/>
-      <parameter type-id='type-id-100' name='filepath' filepath='src/creator.c' line='371' column='1'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/creator.c' line='370' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/creator.c' line='370' column='1'/>
+      <parameter type-id='type-id-94' name='filepath' filepath='src/creator.c' line='371' column='1'/>
       <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='372' column='1'/>
       <parameter is-variadic='yes'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='461' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='461' column='1'/>
-      <parameter type-id='type-id-100' name='ifname' filepath='src/creator.c' line='462' column='1'/>
-      <parameter type-id='type-id-100' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
-      <parameter type-id='type-id-100' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
-      <parameter type-id='type-id-100' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
-      <parameter type-id='type-id-100' name='netmask' filepath='src/creator.c' line='466' column='1'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/creator.c' line='461' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/creator.c' line='461' column='1'/>
+      <parameter type-id='type-id-94' name='ifname' filepath='src/creator.c' line='462' column='1'/>
+      <parameter type-id='type-id-94' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
+      <parameter type-id='type-id-94' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
+      <parameter type-id='type-id-94' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
+      <parameter type-id='type-id-94' name='netmask' filepath='src/creator.c' line='466' column='1'/>
       <parameter type-id='type-id-44' name='local_port' filepath='src/creator.c' line='467' column='1'/>
       <parameter type-id='type-id-44' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
       <parameter type-id='type-id-44' name='protocol' filepath='src/creator.c' line='469' column='1'/>
       <parameter type-id='type-id-53' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31'>
       <return type-id='type-id-31'/>
     </function-decl>
-    <function-decl name='is_partitioned' filepath='src/disk.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-5'/>
-    </function-decl>
-    <function-decl name='make_hd_dn' filepath='src/disk.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-47'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-84'/>
-    </function-decl>
-    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-31'/>
@@ -665,184 +744,168 @@
       <parameter type-id='type-id-44'/>
       <parameter type-id='type-id-44'/>
       <parameter type-id='type-id-13'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-17'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-53'/>
       <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-84'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-83'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-99'/>
+      <parameter type-id='type-id-93'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-75'/>
+    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear'>
+      <return type-id='type-id-73'/>
     </function-decl>
-    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38'>
       <parameter type-id='type-id-13'/>
-      <return type-id='type-id-75'/>
+      <return type-id='type-id-73'/>
     </function-decl>
-    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-88'/>
+    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile'>
+      <return type-id='type-id-86'/>
     </function-decl>
-    <function-decl name='device_get' filepath='src/linux.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-103'/>
+    <typedef-decl name='DIR' type-id='type-id-110' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-105'/>
+    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir'>
+      <parameter type-id='type-id-106'/>
+      <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='device_free' filepath='src/linux.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-103'/>
-      <return type-id='type-id-75'/>
+    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location'>
+      <return type-id='type-id-98'/>
     </function-decl>
-    <function-decl name='set_part' filepath='src/linux.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-103'/>
+    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64'>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-13'/>
+      <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='make_blockdev_path' filepath='src/linux.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
-      <parameter type-id='type-id-103'/>
+    <function-decl name='setmntent' filepath='/usr/include/mntent.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setmntent'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <return type-id='type-id-86'/>
+    </function-decl>
+    <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent'>
+      <parameter type-id='type-id-86'/>
+      <return type-id='type-id-99'/>
+    </function-decl>
+    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endmntent'>
+      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='find_parent_devpath' filepath='src/linux.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-100'/>
-      <parameter type-id='type-id-96'/>
+    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush'>
+      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='make_mac_path' filepath='src/linux.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
-      <parameter type-id='type-id-100'/>
-      <return type-id='type-id-84'/>
+    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf'>
+      <parameter type-id='type-id-86'/>
+      <parameter type-id='type-id-93'/>
+      <parameter is-variadic='yes'/>
+      <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf'>
+      <parameter type-id='type-id-86'/>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-87'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-104'/>
-    </function-decl>
-    <function-decl name='setmntent' filepath='/usr/include/mntent.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
-      <return type-id='type-id-88'/>
-    </function-decl>
-    <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
-      <return type-id='type-id-105'/>
-    </function-decl>
-    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-89'/>
-      <parameter type-id='type-id-101'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-89'/>
-      <parameter type-id='type-id-101'/>
-      <parameter type-id='type-id-93'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-97'/>
-      <parameter type-id='type-id-101'/>
+    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf'>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-95'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='feof' filepath='/usr/include/stdio.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
+    <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof'>
+      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free'>
       <parameter type-id='type-id-26'/>
-      <return type-id='type-id-75'/>
+      <return type-id='type-id-73'/>
     </function-decl>
-    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
       <parameter type-id='type-id-26'/>
       <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-26'/>
     </function-decl>
-    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
       <parameter type-id='type-id-26'/>
       <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-26'/>
     </function-decl>
-    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy'>
       <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-99'/>
+      <parameter type-id='type-id-93'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-27'/>
+    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup'>
+      <parameter type-id='type-id-93'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <return type-id='type-id-27'/>
+    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
+      <parameter type-id='type-id-93'/>
+      <return type-id='type-id-82'/>
     </function-decl>
-    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64'>
+      <parameter type-id='type-id-95'/>
+      <parameter type-id='type-id-103'/>
+      <return type-id='type-id-13'/>
+    </function-decl>
+    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close'>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-101'/>
+    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink'>
       <parameter type-id='type-id-95'/>
-      <parameter type-id='type-id-27'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-89'/>
+      <parameter type-id='type-id-82'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-type size-in-bits='64' id='type-id-94'>
-      <parameter type-id='type-id-103'/>
+    <type-decl name='variadic parameter type' id='type-id-111'/>
+    <type-decl name='void' id='type-id-73'/>
+    <pointer-type-def type-id='type-id-73' id='type-id-26'/>
+    <function-type size-in-bits='64' id='type-id-88'>
+      <parameter type-id='type-id-97'/>
       <return type-id='type-id-17'/>
     </function-type>
-    <function-type size-in-bits='64' id='type-id-108'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-100'/>
-      <parameter type-id='type-id-100'/>
-      <return type-id='type-id-84'/>
+    <function-type size-in-bits='64' id='type-id-100'>
+      <parameter type-id='type-id-97'/>
+      <parameter type-id='type-id-94'/>
+      <parameter type-id='type-id-94'/>
+      <return type-id='type-id-83'/>
     </function-type>
-    <function-type size-in-bits='64' id='type-id-109'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
-      <parameter type-id='type-id-84'/>
-      <return type-id='type-id-84'/>
+    <function-type size-in-bits='64' id='type-id-101'>
+      <parameter type-id='type-id-97'/>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
+      <parameter type-id='type-id-83'/>
+      <return type-id='type-id-83'/>
     </function-type>
   </abi-instr>
   <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
@@ -859,305 +922,311 @@
     <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-115'/>
     <qualified-type-def type-id='type-id-115' restrict='yes' id='type-id-116'/>
     <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-117'/>
-    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-118'/>
-    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-119'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
-    <function-decl name='gpt_disk_get_partition_info' filepath='src/gpt.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-117'/>
-      <parameter type-id='type-id-117'/>
-      <parameter type-id='type-id-114'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-118'/>
+    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
+    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-122'/>
+    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-32'/>
       <parameter type-id='type-id-32'/>
-      <parameter type-id='type-id-110'/>
+      <parameter type-id='type-id-104'/>
       <parameter type-id='type-id-53'/>
       <parameter type-id='type-id-53'/>
-      <return type-id='type-id-84'/>
-    </function-decl>
-    <function-decl name='get_sector_size' filepath='src/linux.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-13'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-119'/>
-      <parameter type-id='type-id-27'/>
-      <parameter type-id='type-id-27'/>
+    <typedef-decl name='DIR' type-id='type-id-121' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-119'/>
+    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_memalign'>
+      <parameter type-id='type-id-118'/>
+      <parameter type-id='type-id-3'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl'>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-3'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64'>
+      <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-102'/>
+      <return type-id='type-id-13'/>
+    </function-decl>
+    <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gettimeofday'>
       <parameter type-id='type-id-116'/>
-      <parameter type-id='type-id-118'/>
+      <parameter type-id='type-id-122'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64'>
+      <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-23'/>
+      <parameter type-id='type-id-13'/>
+      <return type-id='type-id-23'/>
+    </function-decl>
+    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read'>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-27'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-82'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write'>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-27'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-82'/>
+      <return type-id='type-id-83'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' id='type-id-121'>
-      <subrange length='65' type-id='type-id-3' id='type-id-122'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' id='type-id-123'>
+      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-3' id='type-id-124'/>
     </array-type-def>
-    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-123'>
+    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-125'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='sysname' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
+        <var-decl name='sysname' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='520'>
-        <var-decl name='nodename' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
+        <var-decl name='nodename' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1040'>
-        <var-decl name='release' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
+        <var-decl name='release' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1560'>
-        <var-decl name='version' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
+        <var-decl name='version' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2080'>
-        <var-decl name='machine' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
+        <var-decl name='machine' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2600'>
-        <var-decl name='domainname' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
+        <var-decl name='domainname' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
       </data-member>
     </class-decl>
-    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
-    <function-decl name='crc32' filepath='src/crc32.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-3'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-31'/>
+    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
+    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
+    <typedef-decl name='DIR' type-id='type-id-129' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-127'/>
+    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' filepath='/usr/include/stdio.h' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <parameter is-variadic='yes'/>
+      <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-27'/>
+    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc'>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-26'/>
     </function-decl>
-    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
       <parameter type-id='type-id-26'/>
       <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror'>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-124'/>
+    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname'>
+      <parameter type-id='type-id-126'/>
       <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
-    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
+    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc'>
+      <return type-id='type-id-73'/>
+    </function-decl>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
+    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-31'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-31'/>
       <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
-      <return type-id='type-id-84'/>
-    </function-decl>
-    <function-decl name='parse_acpi_hid_uid' filepath='src/linux.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-99'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-13'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='acpi_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='349' column='1'/>
-    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-27'/>
+    <typedef-decl name='DIR' type-id='type-id-132' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-130'/>
+    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr'>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-27'/>
-      <return type-id='type-id-27'/>
+    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-3'/>
+      <return type-id='type-id-82'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-acpi.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
-    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
+    <typedef-decl name='DIR' type-id='type-id-135' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-133'/>
+    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield'>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-97'/>
-      <parameter type-id='type-id-101'/>
-      <parameter type-id='type-id-93'/>
+    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf'>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-95'/>
+      <parameter type-id='type-id-87'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-27'/>
-      <parameter type-id='type-id-27'/>
+    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc'>
+      <parameter type-id='type-id-3'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-26'/>
     </function-decl>
-    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc'>
       <parameter type-id='type-id-26'/>
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-26'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-128'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
-    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-136'/>
+    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
+    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-44'/>
       <parameter type-id='type-id-44'/>
       <parameter type-id='type-id-44'/>
-      <return type-id='type-id-84'/>
-    </function-decl>
-    <function-decl name='parse_scsi_link' filepath='src/linux.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-117'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-128'/>
-      <parameter type-id='type-id-128'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='ata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='359' column='1'/>
-    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <typedef-decl name='DIR' type-id='type-id-139' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-137'/>
+    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr'>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
       <return type-id='type-id-17'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
-    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-142'/>
+    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='emmc_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='360' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-142' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-140'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
+    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-145'/>
     <var-decl name='i2o_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='357' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-145' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-143'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-md.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
+    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
+    <typedef-decl name='DIR' type-id='type-id-148' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-146'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
-    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-151'/>
+    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-110'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-104'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-75'/>
+    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38'>
+      <return type-id='type-id-73'/>
     </function-decl>
     <var-decl name='nvme_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='355' column='1'/>
-    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <typedef-decl name='DIR' type-id='type-id-151' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-149'/>
+    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access'>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
+    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-154'/>
     <var-decl name='pci_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='348' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-154' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-152'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
-    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-157'/>
+    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-53'/>
       <parameter type-id='type-id-53'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='pci_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='352' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-157' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-155'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-136'/>
-    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-160'/>
+    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-114'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid'>
+      <parameter type-id='type-id-93'/>
       <parameter type-id='type-id-114'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <var-decl name='pmem_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='347' column='1'/>
-    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
+    <typedef-decl name='DIR' type-id='type-id-160' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-158'/>
+    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv'>
+      <parameter type-id='type-id-93'/>
       <return type-id='type-id-17'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
-    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-163'/>
+    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-32'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='sas_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='353' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-163' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-161'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-138'>
-      <subrange length='256' type-id='type-id-3' id='type-id-139'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-164'>
+      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' id='type-id-165'/>
     </array-type-def>
-    <type-decl name='short int' size-in-bits='16' id='type-id-140'/>
-    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-141'>
+    <type-decl name='short int' size-in-bits='16' id='type-id-166'/>
+    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-167'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='d_ino' type-id='type-id-142' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
+        <var-decl name='d_ino' type-id='type-id-168' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='d_off' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
@@ -1166,96 +1235,101 @@
         <var-decl name='d_reclen' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='d_type' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
+        <var-decl name='d_type' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='d_name' type-id='type-id-138' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
+        <var-decl name='d_name' type-id='type-id-164' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='__ino64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-142'/>
-    <typedef-decl name='__int16_t' type-id='type-id-140' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-143'/>
-    <typedef-decl name='int16_t' type-id='type-id-143' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-144'/>
-    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-145'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-146'/>
-    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <typedef-decl name='__ino64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-168'/>
+    <typedef-decl name='__int16_t' type-id='type-id-166' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-169'/>
+    <typedef-decl name='int16_t' type-id='type-id-169' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-170'/>
+    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-171'/>
+    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-174'/>
+    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-144'/>
+      <parameter type-id='type-id-170'/>
       <parameter type-id='type-id-44'/>
-      <return type-id='type-id-84'/>
-    </function-decl>
-    <function-decl name='is_pata' filepath='src/linux.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-103'/>
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='sata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='354' column='1'/>
-    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <return type-id='type-id-87'/>
+    <typedef-decl name='DIR' type-id='type-id-174' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-172'/>
+    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir'>
+      <parameter type-id='type-id-93'/>
+      <return type-id='type-id-173'/>
+    </function-decl>
+    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64'>
+      <parameter type-id='type-id-173'/>
+      <return type-id='type-id-171'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-147'/>
-    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-177'/>
+    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-44'/>
       <parameter type-id='type-id-44'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <var-decl name='scsi_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='358' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-177' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-175'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
+    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-180'/>
     <var-decl name='soc_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='350' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-180' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-178'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
+    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
     <var-decl name='virtblk_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='356' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-183' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-181'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-150'/>
+    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-186'/>
     <var-decl name='virtual_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='351' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-186' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-184'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
-    <typedef-decl name='const_efidp' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-152'/>
-    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-153'/>
-    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-155'/>
-    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-151'/>
-    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-156'/>
-    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
-    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-158'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
-    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-84'/>
+    <typedef-decl name='const_efidp' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-188'/>
+    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-189'/>
+    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-191'/>
+    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-187'/>
+    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-192'/>
+    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
+    <qualified-type-def type-id='type-id-193' const='yes' id='type-id-194'/>
+    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-197'/>
+    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr'>
+      <parameter type-id='type-id-104'/>
+      <parameter type-id='type-id-83'/>
       <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-158'/>
-      <parameter type-id='type-id-84'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-194'/>
+      <parameter type-id='type-id-83'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-160'/>
-      <parameter type-id='type-id-27'/>
-      <parameter type-id='type-id-152'/>
-      <parameter type-id='type-id-84'/>
-      <return type-id='type-id-84'/>
+    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path'>
+      <parameter type-id='type-id-198'/>
+      <parameter type-id='type-id-82'/>
+      <parameter type-id='type-id-188'/>
+      <parameter type-id='type-id-83'/>
+      <return type-id='type-id-83'/>
     </function-decl>
-    <function-decl name='find_path_segment' filepath='src/path-helpers.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-153'/>
-      <parameter type-id='type-id-161'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <typedef-decl name='DIR' type-id='type-id-197' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-195'/>
+    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy'>
       <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-3'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='socket'>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-13'/>
@@ -1263,23 +1337,23 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-162'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='unknown' id='type-id-199'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-200'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-164' size-in-bits='infinite' id='type-id-165'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
+    <array-type-def dimensions='1' type-id='type-id-201' size-in-bits='unknown' id='type-id-202'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-200'/>
     </array-type-def>
-    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-167'>
+    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-204'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
+        <var-decl name='addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-170'>
+    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-206' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-207'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
+        <var-decl name='addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='17' column='1' id='type-id-172'>
+    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='17' column='1' id='type-id-209'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='attributes' type-id='type-id-31' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
       </data-member>
@@ -1287,12 +1361,12 @@
         <var-decl name='file_path_list_length' type-id='type-id-44' visibility='default' filepath='src/loadopt.c' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='description' type-id='type-id-173' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
+        <var-decl name='description' type-id='type-id-210' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-175'>
+    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-212'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
@@ -1301,17 +1375,17 @@
         <var-decl name='guid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-178'>
+    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-215'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
+        <var-decl name='adr' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-181'>
+    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-217' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-218'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
@@ -1320,9 +1394,9 @@
         <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-183'>
+    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-219' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-220'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
@@ -1334,12 +1408,12 @@
         <var-decl name='cid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='hidstr' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
+        <var-decl name='hidstr' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-185'>
+    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-222'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='primary' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
@@ -1351,9 +1425,9 @@
         <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-187'>
+    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-223' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-224'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='device_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
@@ -1362,12 +1436,12 @@
         <var-decl name='status' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='description' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
+        <var-decl name='description' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-190'>
+    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-227'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='interface_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
@@ -1376,17 +1450,17 @@
         <var-decl name='base_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' id='type-id-192'>
+    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' id='type-id-229'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-194'>
+    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-231'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
@@ -1395,9 +1469,9 @@
         <var-decl name='addr_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-196'>
+    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-233'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='boot_catalog_entry' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
@@ -1409,36 +1483,36 @@
         <var-decl name='sectors' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-198'>
+    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-235'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='controller' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' id='type-id-200'>
+    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' id='type-id-237'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='is_ipv6' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='addrs' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
+        <var-decl name='addrs' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' id='type-id-202'>
+    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' id='type-id-239'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='slot' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-204'>
+    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-241'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
@@ -1450,9 +1524,9 @@
         <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-206'>
+    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-243'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
@@ -1464,33 +1538,33 @@
         <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' id='type-id-208'>
+    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' id='type-id-245'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='name' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
+        <var-decl name='name' type-id='type-id-210' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-210'>
+    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-247'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-212'>
+    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-249'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-214'>
+    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-251'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='partition_number' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
@@ -1502,7 +1576,7 @@
         <var-decl name='size' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='signature' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
+        <var-decl name='signature' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <var-decl name='format' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
@@ -1511,7 +1585,7 @@
         <var-decl name='signature_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-215'>
+    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-252'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
       </data-member>
@@ -1522,37 +1596,37 @@
         <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-217'>
+    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-253' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-254'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-219'>
+    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-255' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-256'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' id='type-id-221'>
+    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-257' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' id='type-id-258'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='resource_flags' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-259' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='' type-id='type-id-223' visibility='default'/>
+        <var-decl name='' type-id='type-id-260' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <var-decl name='target_port_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
@@ -1561,15 +1635,15 @@
         <var-decl name='device_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-225'>
+    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-261' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-262'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
         <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
@@ -1581,24 +1655,24 @@
         <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-263' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
+        <var-decl name='gateway' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
+        <var-decl name='netmask' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ipv6_addr' size-in-bits='480' is-struct='yes' naming-typedef-id='type-id-227' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-228'>
+    <class-decl name='efidp_ipv6_addr' size-in-bits='480' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-265'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
         <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
@@ -1616,12 +1690,12 @@
         <var-decl name='prefix_length' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='gateway_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
+        <var-decl name='gateway_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-229' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' id='type-id-230'>
+    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' id='type-id-267'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
@@ -1636,42 +1710,42 @@
         <var-decl name='tpgt' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
+        <var-decl name='target_name' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-231' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-232'>
+    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-269'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-233' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-234'>
+    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-271'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-235' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
         <var-decl name='if_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-237'>
+    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-273' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-274'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-239'>
+    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-275' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-276'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='memory_type' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
@@ -1683,28 +1757,28 @@
         <var-decl name='ending_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' id='type-id-241'>
+    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-277' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' id='type-id-278'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-243'>
+    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-279' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-280'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='uuid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' id='type-id-245'>
+    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-281' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' id='type-id-282'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='namespace_id' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
@@ -1713,17 +1787,17 @@
         <var-decl name='ieee_eui_64' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-247'>
+    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-283' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-284'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-249'>
+    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-285' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-286'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
@@ -1732,17 +1806,17 @@
         <var-decl name='device' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' id='type-id-251'>
+    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-287' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' id='type-id-288'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='protocol_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-253'>
+    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-289' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-290'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='start_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
@@ -1757,9 +1831,9 @@
         <var-decl name='instance_number' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-255'>
+    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-291' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-292'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
@@ -1771,9 +1845,9 @@
         <var-decl name='last_byte' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' id='type-id-257'>
+    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-293' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' id='type-id-294'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
@@ -1797,9 +1871,9 @@
         <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' id='type-id-259'>
+    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-295' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' id='type-id-296'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='sas_address' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
@@ -1817,9 +1891,9 @@
         <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-261'>
+    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-297' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-298'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hba_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
@@ -1831,9 +1905,9 @@
         <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-263'>
+    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-299' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-300'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
@@ -1842,17 +1916,17 @@
         <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' id='type-id-265'>
+    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-301' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' id='type-id-302'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='slot_number' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' id='type-id-267'>
+    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-303' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' id='type-id-304'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
@@ -1870,9 +1944,9 @@
         <var-decl name='stop_bits' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' id='type-id-269'>
+    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-305' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' id='type-id-306'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
@@ -1881,9 +1955,9 @@
         <var-decl name='flow_control_map' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' id='type-id-271'>
+    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-307' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' id='type-id-308'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
@@ -1892,17 +1966,17 @@
         <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-273'>
+    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-309' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-310'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
+        <var-decl name='uri' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-274' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-275'>
+    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-311' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-312'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='parent_port' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
@@ -1911,9 +1985,9 @@
         <var-decl name='interface' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-276' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-277'>
+    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-313' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-314'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
@@ -1931,9 +2005,9 @@
         <var-decl name='device_protocol' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-278' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-279'>
+    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-315' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-316'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='interface' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
@@ -1945,26 +2019,26 @@
         <var-decl name='product_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-210' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-280' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' id='type-id-281'>
+    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-317' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' id='type-id-318'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vlan_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-282' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' id='type-id-283'>
+    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-319' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' id='type-id-320'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-235' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
+        <var-decl name='ssid' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' id='type-id-284'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' id='type-id-321'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
       </data-member>
@@ -1975,262 +2049,262 @@
         <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ip_addr_t' type-id='type-id-285' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-164'/>
-    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-167' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-166'/>
-    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-170' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-169'/>
-    <typedef-decl name='efi_load_option' type-id='type-id-172' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-286'/>
-    <typedef-decl name='efidp' type-id='type-id-287' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' id='type-id-288'/>
-    <typedef-decl name='efidp_1394' type-id='type-id-175' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-174'/>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-177'/>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-180'/>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-183' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-182'/>
-    <typedef-decl name='efidp_atapi' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-184'/>
-    <typedef-decl name='efidp_bios_boot' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-186'/>
-    <typedef-decl name='efidp_bmc' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-189'/>
-    <typedef-decl name='efidp_boolean' type-id='type-id-53' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-226'/>
-    <typedef-decl name='efidp_bt' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-191'/>
-    <typedef-decl name='efidp_btle' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-193'/>
-    <typedef-decl name='efidp_cdrom' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-195'/>
-    <typedef-decl name='efidp_controller' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-197'/>
-    <typedef-decl name='efidp_data' type-id='type-id-289' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-154'/>
-    <typedef-decl name='efidp_dns' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-199'/>
-    <typedef-decl name='efidp_emmc' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-201'/>
-    <typedef-decl name='efidp_fc' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-203'/>
-    <typedef-decl name='efidp_fcex' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-205'/>
-    <typedef-decl name='efidp_file' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-207'/>
-    <typedef-decl name='efidp_firmware_file' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-209'/>
-    <typedef-decl name='efidp_firmware_volume' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-211'/>
-    <typedef-decl name='efidp_hd' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-213'/>
-    <typedef-decl name='efidp_header' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-176'/>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-216'/>
-    <typedef-decl name='efidp_i2o' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-218'/>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-220'/>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-225' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-224'/>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-228' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-227'/>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-230' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-229'/>
-    <typedef-decl name='efidp_lun' type-id='type-id-232' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-231'/>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-234' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-233'/>
-    <typedef-decl name='efidp_media_vendor' type-id='type-id-237' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-236'/>
-    <typedef-decl name='efidp_mmio' type-id='type-id-239' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-238'/>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-241' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-240'/>
-    <typedef-decl name='efidp_nvdimm' type-id='type-id-243' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-242'/>
-    <typedef-decl name='efidp_nvme' type-id='type-id-245' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-244'/>
-    <typedef-decl name='efidp_pccard' type-id='type-id-247' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-246'/>
-    <typedef-decl name='efidp_pci' type-id='type-id-249' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-248'/>
-    <typedef-decl name='efidp_protocol' type-id='type-id-251' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-250'/>
-    <typedef-decl name='efidp_ramdisk' type-id='type-id-253' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-252'/>
-    <typedef-decl name='efidp_relative_offset' type-id='type-id-255' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-254'/>
-    <typedef-decl name='efidp_sas' type-id='type-id-257' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-256'/>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-259' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-258'/>
-    <typedef-decl name='efidp_sata' type-id='type-id-261' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-260'/>
-    <typedef-decl name='efidp_scsi' type-id='type-id-263' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-262'/>
-    <typedef-decl name='efidp_sd' type-id='type-id-265' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-264'/>
-    <typedef-decl name='efidp_uart' type-id='type-id-267' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-266'/>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-269' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-268'/>
-    <typedef-decl name='efidp_ufs' type-id='type-id-271' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-270'/>
-    <typedef-decl name='efidp_uri' type-id='type-id-273' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-272'/>
-    <typedef-decl name='efidp_usb' type-id='type-id-275' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-274'/>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-277' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-276'/>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-279' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-278'/>
-    <typedef-decl name='efidp_vlan' type-id='type-id-281' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-280'/>
-    <typedef-decl name='efidp_wifi' type-id='type-id-283' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-282'/>
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='infinite' id='type-id-173'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
+    <typedef-decl name='efi_ip_addr_t' type-id='type-id-322' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-201'/>
+    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-204' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-203'/>
+    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-207' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-206'/>
+    <typedef-decl name='efi_load_option' type-id='type-id-209' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-323'/>
+    <typedef-decl name='efidp' type-id='type-id-324' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' id='type-id-325'/>
+    <typedef-decl name='efidp_1394' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-211'/>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-214'/>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-218' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-217'/>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-220' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-219'/>
+    <typedef-decl name='efidp_atapi' type-id='type-id-222' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-221'/>
+    <typedef-decl name='efidp_bios_boot' type-id='type-id-224' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-223'/>
+    <typedef-decl name='efidp_bmc' type-id='type-id-227' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-226'/>
+    <typedef-decl name='efidp_boolean' type-id='type-id-53' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-263'/>
+    <typedef-decl name='efidp_bt' type-id='type-id-229' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-228'/>
+    <typedef-decl name='efidp_btle' type-id='type-id-231' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-230'/>
+    <typedef-decl name='efidp_cdrom' type-id='type-id-233' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-232'/>
+    <typedef-decl name='efidp_controller' type-id='type-id-235' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-234'/>
+    <typedef-decl name='efidp_data' type-id='type-id-326' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-190'/>
+    <typedef-decl name='efidp_dns' type-id='type-id-237' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-236'/>
+    <typedef-decl name='efidp_emmc' type-id='type-id-239' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-238'/>
+    <typedef-decl name='efidp_fc' type-id='type-id-241' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-240'/>
+    <typedef-decl name='efidp_fcex' type-id='type-id-243' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-242'/>
+    <typedef-decl name='efidp_file' type-id='type-id-245' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-244'/>
+    <typedef-decl name='efidp_firmware_file' type-id='type-id-247' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-246'/>
+    <typedef-decl name='efidp_firmware_volume' type-id='type-id-249' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-248'/>
+    <typedef-decl name='efidp_hd' type-id='type-id-251' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-250'/>
+    <typedef-decl name='efidp_header' type-id='type-id-252' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-213'/>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-254' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-253'/>
+    <typedef-decl name='efidp_i2o' type-id='type-id-256' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-255'/>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-258' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-257'/>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-262' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-261'/>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-265' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-264'/>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-267' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-266'/>
+    <typedef-decl name='efidp_lun' type-id='type-id-269' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-268'/>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-271' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-270'/>
+    <typedef-decl name='efidp_media_vendor' type-id='type-id-274' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-273'/>
+    <typedef-decl name='efidp_mmio' type-id='type-id-276' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-275'/>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-278' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-277'/>
+    <typedef-decl name='efidp_nvdimm' type-id='type-id-280' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-279'/>
+    <typedef-decl name='efidp_nvme' type-id='type-id-282' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-281'/>
+    <typedef-decl name='efidp_pccard' type-id='type-id-284' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-283'/>
+    <typedef-decl name='efidp_pci' type-id='type-id-286' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-285'/>
+    <typedef-decl name='efidp_protocol' type-id='type-id-288' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-287'/>
+    <typedef-decl name='efidp_ramdisk' type-id='type-id-290' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-289'/>
+    <typedef-decl name='efidp_relative_offset' type-id='type-id-292' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-291'/>
+    <typedef-decl name='efidp_sas' type-id='type-id-294' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-293'/>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-296' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-295'/>
+    <typedef-decl name='efidp_sata' type-id='type-id-298' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-297'/>
+    <typedef-decl name='efidp_scsi' type-id='type-id-300' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-299'/>
+    <typedef-decl name='efidp_sd' type-id='type-id-302' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-301'/>
+    <typedef-decl name='efidp_uart' type-id='type-id-304' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-303'/>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-306' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-305'/>
+    <typedef-decl name='efidp_ufs' type-id='type-id-308' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-307'/>
+    <typedef-decl name='efidp_uri' type-id='type-id-310' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-309'/>
+    <typedef-decl name='efidp_usb' type-id='type-id-312' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-311'/>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-314' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-313'/>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-316' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-315'/>
+    <typedef-decl name='efidp_vlan' type-id='type-id-318' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-317'/>
+    <typedef-decl name='efidp_wifi' type-id='type-id-320' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-319'/>
+    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='unknown' id='type-id-210'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-200'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-290'>
-      <subrange length='4' type-id='type-id-3' id='type-id-291'/>
+    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-327'>
+      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-328'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='infinite' id='type-id-179'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
+    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='unknown' id='type-id-216'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-200'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' id='type-id-222'>
-      <subrange length='2' type-id='type-id-3' id='type-id-292'/>
+    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' id='type-id-259'>
+      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-329'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='128' id='type-id-171'>
-      <subrange length='16' type-id='type-id-3' id='type-id-293'/>
+    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='128' id='type-id-208'>
+      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' id='type-id-330'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='256' id='type-id-235'>
-      <subrange length='32' type-id='type-id-3' id='type-id-294'/>
+    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='256' id='type-id-272'>
+      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' id='type-id-331'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='32' id='type-id-168'>
-      <subrange length='4' type-id='type-id-3' id='type-id-291'/>
+    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='32' id='type-id-205'>
+      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-328'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='infinite' id='type-id-188'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
+    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='unknown' id='type-id-225'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-200'/>
     </array-type-def>
-    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-285'>
+    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-322'>
       <data-member access='public'>
-        <var-decl name='addr' type-id='type-id-290' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
+        <var-decl name='addr' type-id='type-id-327' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v4' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
+        <var-decl name='v4' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v6' type-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
+        <var-decl name='v6' type-id='type-id-206' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
       </data-member>
     </union-decl>
-    <union-decl name='efidp_data' size-in-bits='480' naming-typedef-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' id='type-id-289'>
+    <union-decl name='efidp_data' size-in-bits='480' naming-typedef-id='type-id-190' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' id='type-id-326'>
       <data-member access='public'>
-        <var-decl name='' type-id='type-id-284' visibility='default'/>
+        <var-decl name='' type-id='type-id-321' visibility='default'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
+        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pci' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
+        <var-decl name='pci' type-id='type-id-285' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pccard' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
+        <var-decl name='pccard' type-id='type-id-283' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mmio' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
+        <var-decl name='mmio' type-id='type-id-275' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hw_vendor' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
+        <var-decl name='hw_vendor' type-id='type-id-253' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='controller' type-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
+        <var-decl name='controller' type-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bmc' type-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
+        <var-decl name='bmc' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid' type-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-217' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid_ex' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
+        <var-decl name='acpi_hid_ex' type-id='type-id-219' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_adr' type-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
+        <var-decl name='acpi_adr' type-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='atapi' type-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
+        <var-decl name='atapi' type-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='scsi' type-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
+        <var-decl name='scsi' type-id='type-id-299' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fc' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
+        <var-decl name='fc' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fcex' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
+        <var-decl name='fcex' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firewire' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
+        <var-decl name='firewire' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb' type-id='type-id-274' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
+        <var-decl name='usb' type-id='type-id-311' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_class' type-id='type-id-276' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
+        <var-decl name='usb_class' type-id='type-id-313' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_wwid' type-id='type-id-278' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
+        <var-decl name='usb_wwid' type-id='type-id-315' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='lun' type-id='type-id-231' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
+        <var-decl name='lun' type-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sata' type-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
+        <var-decl name='sata' type-id='type-id-297' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='i2o' type-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
+        <var-decl name='i2o' type-id='type-id-255' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mac_addr' type-id='type-id-233' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv4_addr' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
+        <var-decl name='ipv4_addr' type-id='type-id-261' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv6_addr' type-id='type-id-227' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
+        <var-decl name='ipv6_addr' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='vlan' type-id='type-id-280' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
+        <var-decl name='vlan' type-id='type-id-317' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='infiniband' type-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
+        <var-decl name='infiniband' type-id='type-id-257' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart' type-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
+        <var-decl name='uart' type-id='type-id-303' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='msg_vendor' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
+        <var-decl name='msg_vendor' type-id='type-id-277' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart_flow_control' type-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
+        <var-decl name='uart_flow_control' type-id='type-id-305' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas' type-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
+        <var-decl name='sas' type-id='type-id-293' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas_ex' type-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
+        <var-decl name='sas_ex' type-id='type-id-295' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='iscsi' type-id='type-id-229' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
+        <var-decl name='iscsi' type-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvme' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
+        <var-decl name='nvme' type-id='type-id-281' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uri' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
+        <var-decl name='uri' type-id='type-id-309' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ufs' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
+        <var-decl name='ufs' type-id='type-id-307' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sd' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
+        <var-decl name='sd' type-id='type-id-301' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bt' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
+        <var-decl name='bt' type-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='wifi' type-id='type-id-282' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
+        <var-decl name='wifi' type-id='type-id-319' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='emmc' type-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
+        <var-decl name='emmc' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='btle' type-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
+        <var-decl name='btle' type-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='dns' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
+        <var-decl name='dns' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvdimm' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
+        <var-decl name='nvdimm' type-id='type-id-279' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hd' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
+        <var-decl name='hd' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='cdrom' type-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
+        <var-decl name='cdrom' type-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='media_vendor' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
+        <var-decl name='media_vendor' type-id='type-id-273' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='file' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
+        <var-decl name='file' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='protocol' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
+        <var-decl name='protocol' type-id='type-id-287' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_file' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
+        <var-decl name='firmware_file' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_volume' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
+        <var-decl name='firmware_volume' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='relative_offset' type-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
+        <var-decl name='relative_offset' type-id='type-id-291' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ramdisk' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
+        <var-decl name='ramdisk' type-id='type-id-289' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bios_boot' type-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
+        <var-decl name='bios_boot' type-id='type-id-223' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
       </data-member>
     </union-decl>
-    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' id='type-id-223'>
+    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' id='type-id-260'>
       <data-member access='public'>
         <var-decl name='ioc_guid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
       </data-member>
@@ -2238,121 +2312,133 @@
         <var-decl name='service_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
       </data-member>
     </union-decl>
-    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-295'/>
-    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-296'/>
-    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-297'/>
-    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
-    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
-    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-300'/>
-    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-287'/>
-    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-161'/>
-    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-301'/>
-    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-160'/>
-    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-302'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-303'/>
-    <function-decl name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <qualified-type-def type-id='type-id-86' restrict='yes' id='type-id-332'/>
+    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-333'/>
+    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
+    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-335'/>
+    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
+    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
+    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-338'/>
+    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-324'/>
+    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-339'/>
+    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-340'/>
+    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-198'/>
+    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-341'/>
+    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-344'/>
+    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-345'/>
+    <function-decl name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose'>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='src/loadopt.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/loadopt.c' line='26' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/loadopt.c' line='26' column='1'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/loadopt.c' line='26' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/loadopt.c' line='26' column='1'/>
       <parameter type-id='type-id-31' name='attributes' filepath='src/loadopt.c' line='26' column='1'/>
-      <parameter type-id='type-id-288' name='dp' filepath='src/loadopt.c' line='27' column='1'/>
-      <parameter type-id='type-id-84' name='dp_size' filepath='src/loadopt.c' line='27' column='1'/>
-      <parameter type-id='type-id-160' name='description' filepath='src/loadopt.c' line='27' column='1'/>
-      <parameter type-id='type-id-110' name='optional_data' filepath='src/loadopt.c' line='28' column='1'/>
-      <parameter type-id='type-id-27' name='optional_data_size' filepath='src/loadopt.c' line='28' column='1'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-325' name='dp' filepath='src/loadopt.c' line='27' column='1'/>
+      <parameter type-id='type-id-83' name='dp_size' filepath='src/loadopt.c' line='27' column='1'/>
+      <parameter type-id='type-id-198' name='description' filepath='src/loadopt.c' line='27' column='1'/>
+      <parameter type-id='type-id-104' name='optional_data' filepath='src/loadopt.c' line='28' column='1'/>
+      <parameter type-id='type-id-82' name='optional_data_size' filepath='src/loadopt.c' line='28' column='1'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' filepath='src/loadopt.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='102' column='1'/>
-      <parameter type-id='type-id-27' name='size' filepath='src/loadopt.c' line='102' column='1'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='102' column='1'/>
+      <parameter type-id='type-id-82' name='size' filepath='src/loadopt.c' line='102' column='1'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' filepath='src/loadopt.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='152' column='1'/>
-      <parameter type-id='type-id-27' name='size' filepath='src/loadopt.c' line='152' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='152' column='1'/>
+      <parameter type-id='type-id-82' name='size' filepath='src/loadopt.c' line='152' column='1'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' filepath='src/loadopt.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='161' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='161' column='1'/>
       <return type-id='type-id-31'/>
     </function-decl>
     <function-decl name='efi_loadopt_attr_set' mangled-name='efi_loadopt_attr_set' filepath='src/loadopt.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_set@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='167' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='167' column='1'/>
       <parameter type-id='type-id-44' name='attr' filepath='src/loadopt.c' line='167' column='1'/>
-      <return type-id='type-id-75'/>
+      <return type-id='type-id-73'/>
     </function-decl>
     <function-decl name='efi_loadopt_attr_clear' mangled-name='efi_loadopt_attr_clear' filepath='src/loadopt.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_clear@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='173' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='173' column='1'/>
       <parameter type-id='type-id-44' name='attr' filepath='src/loadopt.c' line='173' column='1'/>
-      <return type-id='type-id-75'/>
+      <return type-id='type-id-73'/>
     </function-decl>
     <function-decl name='efi_loadopt_pathlen' mangled-name='efi_loadopt_pathlen' filepath='src/loadopt.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_pathlen@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='180' column='1'/>
-      <parameter type-id='type-id-84' name='limit' filepath='src/loadopt.c' line='180' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='180' column='1'/>
+      <parameter type-id='type-id-83' name='limit' filepath='src/loadopt.c' line='180' column='1'/>
       <return type-id='type-id-44'/>
     </function-decl>
     <function-decl name='efi_loadopt_path' mangled-name='efi_loadopt_path' filepath='src/loadopt.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='194' column='1'/>
-      <parameter type-id='type-id-84' name='limit' filepath='src/loadopt.c' line='194' column='1'/>
-      <return type-id='type-id-288'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='194' column='1'/>
+      <parameter type-id='type-id-83' name='limit' filepath='src/loadopt.c' line='194' column='1'/>
+      <return type-id='type-id-325'/>
     </function-decl>
     <function-decl name='efi_loadopt_optional_data' mangled-name='efi_loadopt_optional_data' filepath='src/loadopt.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='223' column='1'/>
-      <parameter type-id='type-id-27' name='opt_size' filepath='src/loadopt.c' line='223' column='1'/>
-      <parameter type-id='type-id-302' name='datap' filepath='src/loadopt.c' line='224' column='1'/>
-      <parameter type-id='type-id-161' name='len' filepath='src/loadopt.c' line='224' column='1'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='223' column='1'/>
+      <parameter type-id='type-id-82' name='opt_size' filepath='src/loadopt.c' line='223' column='1'/>
+      <parameter type-id='type-id-341' name='datap' filepath='src/loadopt.c' line='224' column='1'/>
+      <parameter type-id='type-id-339' name='len' filepath='src/loadopt.c' line='224' column='1'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='efi_loadopt_args_from_file' mangled-name='efi_loadopt_args_from_file' filepath='src/loadopt.c' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_from_file@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/loadopt.c' line='256' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/loadopt.c' line='256' column='1'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/loadopt.c' line='256' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/loadopt.c' line='256' column='1'/>
       <parameter type-id='type-id-17' name='filename' filepath='src/loadopt.c' line='256' column='1'/>
-      <return type-id='type-id-84'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_loadopt_args_as_utf8' mangled-name='efi_loadopt_args_as_utf8' filepath='src/loadopt.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_utf8@@libefiboot.so.0'>
-      <parameter type-id='type-id-110' name='buf' filepath='src/loadopt.c' line='299' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/loadopt.c' line='299' column='1'/>
-      <parameter type-id='type-id-110' name='utf8' filepath='src/loadopt.c' line='299' column='1'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-104' name='buf' filepath='src/loadopt.c' line='299' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/loadopt.c' line='299' column='1'/>
+      <parameter type-id='type-id-104' name='utf8' filepath='src/loadopt.c' line='299' column='1'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_loadopt_args_as_ucs2' mangled-name='efi_loadopt_args_as_ucs2' filepath='src/loadopt.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_ucs2@@libefiboot.so.0'>
-      <parameter type-id='type-id-301' name='buf' filepath='src/loadopt.c' line='324' column='1'/>
-      <parameter type-id='type-id-84' name='size' filepath='src/loadopt.c' line='324' column='1'/>
-      <parameter type-id='type-id-110' name='utf8' filepath='src/loadopt.c' line='324' column='1'/>
-      <return type-id='type-id-84'/>
+      <parameter type-id='type-id-340' name='buf' filepath='src/loadopt.c' line='324' column='1'/>
+      <parameter type-id='type-id-83' name='size' filepath='src/loadopt.c' line='324' column='1'/>
+      <parameter type-id='type-id-104' name='utf8' filepath='src/loadopt.c' line='324' column='1'/>
+      <return type-id='type-id-83'/>
     </function-decl>
     <function-decl name='efi_loadopt_desc' mangled-name='efi_loadopt_desc' filepath='src/loadopt.c' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_desc@@libefiboot.so.0'>
-      <parameter type-id='type-id-300' name='opt' filepath='src/loadopt.c' line='355' column='1'/>
-      <parameter type-id='type-id-84' name='limit' filepath='src/loadopt.c' line='355' column='1'/>
-      <return type-id='type-id-296'/>
+      <parameter type-id='type-id-338' name='opt' filepath='src/loadopt.c' line='355' column='1'/>
+      <parameter type-id='type-id-83' name='limit' filepath='src/loadopt.c' line='355' column='1'/>
+      <return type-id='type-id-334'/>
     </function-decl>
-    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-299'/>
+    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc'>
+      <return type-id='type-id-337'/>
     </function-decl>
-    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
+    <typedef-decl name='DIR' type-id='type-id-344' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-342'/>
+    <var-decl name='stdout' type-id='type-id-86' visibility='default' filepath='/usr/include/stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
+    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose'>
+      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='fread' filepath='/usr/include/stdio.h' line='733' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-118'/>
-      <parameter type-id='type-id-27'/>
-      <parameter type-id='type-id-27'/>
-      <parameter type-id='type-id-89'/>
-      <return type-id='type-id-27'/>
+    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen64'>
+      <parameter type-id='type-id-95'/>
+      <parameter type-id='type-id-95'/>
+      <return type-id='type-id-86'/>
     </function-decl>
-    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-88'/>
+    <function-decl name='fread' filepath='/usr/include/stdio.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread'>
+      <parameter type-id='type-id-345'/>
+      <parameter type-id='type-id-82'/>
+      <parameter type-id='type-id-82'/>
+      <parameter type-id='type-id-332'/>
+      <return type-id='type-id-82'/>
+    </function-decl>
+    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno'>
+      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='path-helpers.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-304'/>
-    <function-decl name='strcspn' filepath='/usr/include/string.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-99'/>
-      <parameter type-id='type-id-99'/>
-      <return type-id='type-id-27'/>
+    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-348'/>
+    <typedef-decl name='DIR' type-id='type-id-348' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-346'/>
+    <function-decl name='strcspn' filepath='/usr/include/string.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcspn'>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-93'/>
+      <return type-id='type-id-82'/>
     </function-decl>
   </abi-instr>
 </abi-corpus>
diff --git a/src/libefisec.abixml b/src/libefisec.abixml
index 27b3c813906..c1ecc79267b 100644
--- a/src/libefisec.abixml
+++ b/src/libefisec.abixml
@@ -1,4 +1,4 @@
-<abi-corpus version='2.1' path='libefisec.so' architecture='elf-amd-x86_64' soname='libefisec.so.1'>
+<abi-corpus version='2.3' path='libefisec.so' architecture='elf-amd-x86_64' soname='libefisec.so.1'>
   <elf-needed>
     <dependency name='libc.so.6'/>
   </elf-needed>
@@ -15,106 +15,128 @@
   <elf-variable-symbols>
     <elf-symbol name='efi_secdb_algs_' size='576' version='LIBEFISEC_1.38' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
   </elf-variable-symbols>
+  <undefined-elf-function-symbols>
+    <elf-symbol name='__cxa_finalize' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='__errno_location' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='calloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='closedir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='fflush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='fprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='qsort_r' version='GLIBC_2.8' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='sysconf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='warnx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+  </undefined-elf-function-symbols>
+  <undefined-elf-variable-symbols>
+    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_error_set' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_get_logfile' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_cmp' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_rsa2048' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_rsa2048_sha1' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_rsa2048_sha256' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_sha1' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_sha224' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_sha256' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_sha384' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_sha512' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_to_id_guid' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_x509_cert' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_x509_sha256' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_x509_sha384' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_guid_x509_sha512' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+    <elf-symbol name='efi_set_loglevel' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
+  </undefined-elf-variable-symbols>
   <abi-instr address-size='64' path='esl-iter.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-1'/>
-    <function-decl name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
+    <var-decl name='efi_guid_x509_cert' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='48' column='1' elf-symbol-id='efi_guid_x509_cert'/>
+    <typedef-decl name='DIR' type-id='type-id-3' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-1'/>
+    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir'>
       <parameter type-id='type-id-2'/>
-      <parameter type-id='type-id-2'/>
-      <return type-id='type-id-3'/>
-    </function-decl>
-    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-4'/>
-      <parameter type-id='type-id-4'/>
-      <parameter type-id='type-id-3'/>
-      <parameter type-id='type-id-3'/>
-      <parameter type-id='type-id-4'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-3'/>
-    </function-decl>
-    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-3'/>
       <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-6'/>
-    </function-decl>
-    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-7'/>
-      <return type-id='type-id-3'/>
-    </function-decl>
-    <function-decl name='warnx' filepath='/usr/include/err.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-4'/>
+    <function-decl name='warnx' filepath='/usr/include/err.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='warnx'>
+      <parameter type-id='type-id-6'/>
       <parameter is-variadic='yes'/>
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location'>
       <return type-id='type-id-8'/>
     </function-decl>
-    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-6'/>
-      <return type-id='type-id-3'/>
+    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush'>
+      <parameter type-id='type-id-9'/>
+      <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf'>
       <parameter type-id='type-id-9'/>
-      <parameter type-id='type-id-10'/>
+      <parameter type-id='type-id-6'/>
       <parameter is-variadic='yes'/>
-      <return type-id='type-id-3'/>
+      <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf'>
       <parameter type-id='type-id-9'/>
+      <parameter type-id='type-id-6'/>
       <parameter type-id='type-id-10'/>
+      <return type-id='type-id-5'/>
+    </function-decl>
+    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc'>
       <parameter type-id='type-id-11'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-11'/>
+      <return type-id='type-id-12'/>
     </function-decl>
-    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free'>
       <parameter type-id='type-id-12'/>
-      <parameter type-id='type-id-12'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-3'/>
+    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
       <parameter type-id='type-id-12'/>
-      <return type-id='type-id-13'/>
+      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-11'/>
+      <return type-id='type-id-12'/>
     </function-decl>
-    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-13'/>
+    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
+      <parameter type-id='type-id-12'/>
       <parameter type-id='type-id-12'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-11'/>
+      <return type-id='type-id-5'/>
     </function-decl>
-    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-4'/>
-      <return type-id='type-id-12'/>
+    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
+      <parameter type-id='type-id-6'/>
+      <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='sec.c' comp-dir-path='src' language='LANG_C11'>
-    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
-    <typedef-decl name='DIR' type-id='type-id-14' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-15'/>
-    <typedef-decl name='__uint32_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-17'/>
-    <typedef-decl name='uint32_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-18'/>
-    <type-decl name='unsigned int' size-in-bits='32' id='type-id-16'/>
-    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-7'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-14'/>
+    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
+    <typedef-decl name='__uint32_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-15'/>
+    <typedef-decl name='uint32_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-16'/>
+    <type-decl name='unsigned int' size-in-bits='32' id='type-id-14'/>
+    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
     <function-decl name='efi_get_libefisec_version' mangled-name='efi_get_libefisec_version' filepath='src/sec.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefisec_version@@LIBEFISEC_1.38'>
-      <return type-id='type-id-18'/>
+      <return type-id='type-id-16'/>
     </function-decl>
+    <typedef-decl name='DIR' type-id='type-id-19' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-17'/>
   </abi-instr>
   <abi-instr address-size='64' path='secdb.c' comp-dir-path='src' language='LANG_C11'>
-    <type-decl name='bool' size-in-bits='8' id='type-id-19'/>
-    <type-decl name='char' size-in-bits='8' id='type-id-20'/>
-    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='8' id='type-id-21'>
-      <subrange length='1' type-id='type-id-22' id='type-id-23'/>
+    <type-decl name='bool' size-in-bits='8' id='type-id-20'/>
+    <type-decl name='char' size-in-bits='8' id='type-id-21'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='8' id='type-id-22'>
+      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-11' id='type-id-23'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='160' id='type-id-24'>
-      <subrange length='20' type-id='type-id-22' id='type-id-25'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='160' id='type-id-24'>
+      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-11' id='type-id-25'/>
     </array-type-def>
     <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='4608' id='type-id-27'>
-      <subrange length='12' type-id='type-id-22' id='type-id-28'/>
+      <subrange length='12' lower-bound='0' upper-bound='11' type-id='type-id-11' id='type-id-28'/>
     </array-type-def>
     <enum-decl name='efi_secdb_flag_t' naming-typedef-id='type-id-29' filepath='src/include/efivar/efisec-secdb.h' line='47' column='1' id='type-id-30'>
       <underlying-type type-id='type-id-31'/>
@@ -158,7 +180,7 @@
     <type-decl name='signed char' size-in-bits='8' id='type-id-39'/>
     <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-40'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='_flags' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
+        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='_IO_read_ptr' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
@@ -200,10 +222,10 @@
         <var-decl name='_chain' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='_fileno' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
+        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='928'>
-        <var-decl name='_flags2' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
+        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
         <var-decl name='_old_offset' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
@@ -215,7 +237,7 @@
         <var-decl name='_vtable_offset' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1048'>
-        <var-decl name='_shortbuf' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
+        <var-decl name='_shortbuf' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1088'>
         <var-decl name='_lock' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
@@ -233,416 +255,400 @@
         <var-decl name='_freeres_list' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1408'>
-        <var-decl name='_freeres_buf' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
+        <var-decl name='_freeres_buf' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1472'>
-        <var-decl name='__pad5' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
+        <var-decl name='_prevchain' type-id='type-id-50' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1536'>
-        <var-decl name='_mode' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
+        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1568'>
         <var-decl name='_unused2' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-50'>
+    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-51'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='gp_offset' type-id='type-id-16' visibility='default'/>
+        <var-decl name='gp_offset' type-id='type-id-14' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='fp_offset' type-id='type-id-16' visibility='default'/>
+        <var-decl name='fp_offset' type-id='type-id-14' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='overflow_arg_area' type-id='type-id-13' visibility='default'/>
+        <var-decl name='overflow_arg_area' type-id='type-id-12' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='reg_save_area' type-id='type-id-13' visibility='default'/>
+        <var-decl name='reg_save_area' type-id='type-id-12' visibility='default'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_cert_x509_sha256_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-51' visibility='default' filepath='src/include/efivar/efisec-types.h' line='39' column='1' id='type-id-52'>
+    <class-decl name='efi_cert_x509_sha256_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-52' visibility='default' filepath='src/include/efivar/efisec-types.h' line='39' column='1' id='type-id-53'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efisec-types.h' line='40' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-types.h' line='40' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='time_of_revocation' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-types.h' line='41' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efisec-types.h' line='41' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_cert_x509_sha384_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-55' visibility='default' filepath='src/include/efivar/efisec-types.h' line='44' column='1' id='type-id-56'>
+    <class-decl name='efi_cert_x509_sha384_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-56' visibility='default' filepath='src/include/efivar/efisec-types.h' line='44' column='1' id='type-id-57'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efisec-types.h' line='45' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-types.h' line='45' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='time_of_revocation' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-types.h' line='46' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efisec-types.h' line='46' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_cert_x509_sha512_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-types.h' line='49' column='1' id='type-id-59'>
+    <class-decl name='efi_cert_x509_sha512_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-types.h' line='49' column='1' id='type-id-60'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-types.h' line='50' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-types.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='time_of_revocation' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-types.h' line='51' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efisec-types.h' line='51' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-62'>
+    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-63'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
+        <var-decl name='a' type-id='type-id-16' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
+        <var-decl name='b' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
+        <var-decl name='c' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
+        <var-decl name='d' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
+        <var-decl name='e' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_secdb' size-in-bits='576' is-struct='yes' visibility='default' filepath='src/secdb.h' line='43' column='1' id='type-id-65'>
+    <class-decl name='efi_secdb' size-in-bits='576' is-struct='yes' visibility='default' filepath='src/secdb.h' line='43' column='1' id='type-id-66'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='list' type-id='type-id-66' visibility='default' filepath='src/secdb.h' line='44' column='1'/>
+        <var-decl name='list' type-id='type-id-67' visibility='default' filepath='src/secdb.h' line='44' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='flags' type-id='type-id-67' visibility='default' filepath='src/secdb.h' line='46' column='1'/>
+        <var-decl name='flags' type-id='type-id-68' visibility='default' filepath='src/secdb.h' line='46' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <var-decl name='algorithm' type-id='type-id-32' visibility='default' filepath='src/secdb.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='224'>
-        <var-decl name='listsz' type-id='type-id-18' visibility='default' filepath='src/secdb.h' line='48' column='1'/>
+        <var-decl name='listsz' type-id='type-id-16' visibility='default' filepath='src/secdb.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='hdrsz' type-id='type-id-18' visibility='default' filepath='src/secdb.h' line='49' column='1'/>
+        <var-decl name='hdrsz' type-id='type-id-16' visibility='default' filepath='src/secdb.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='sigsz' type-id='type-id-18' visibility='default' filepath='src/secdb.h' line='50' column='1'/>
+        <var-decl name='sigsz' type-id='type-id-16' visibility='default' filepath='src/secdb.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='nsigs' type-id='type-id-12' visibility='default' filepath='src/secdb.h' line='51' column='1'/>
+        <var-decl name='nsigs' type-id='type-id-13' visibility='default' filepath='src/secdb.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='header' type-id='type-id-13' visibility='default' filepath='src/secdb.h' line='52' column='1'/>
+        <var-decl name='header' type-id='type-id-12' visibility='default' filepath='src/secdb.h' line='52' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='entries' type-id='type-id-66' visibility='default' filepath='src/secdb.h' line='53' column='1'/>
+        <var-decl name='entries' type-id='type-id-67' visibility='default' filepath='src/secdb.h' line='53' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_time_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-types.h' line='73' column='1' id='type-id-68'>
+    <class-decl name='efi_time_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar-types.h' line='73' column='1' id='type-id-69'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='year' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='74' column='1'/>
+        <var-decl name='year' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-types.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='month' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='75' column='1'/>
+        <var-decl name='month' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='24'>
-        <var-decl name='day' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='76' column='1'/>
+        <var-decl name='day' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hour' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='77' column='1'/>
+        <var-decl name='hour' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='minute' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='78' column='1'/>
+        <var-decl name='minute' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='78' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='second' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='79' column='1'/>
+        <var-decl name='second' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='56'>
-        <var-decl name='pad1' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='80' column='1'/>
+        <var-decl name='pad1' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='nanosecond' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-types.h' line='81' column='1'/>
+        <var-decl name='nanosecond' type-id='type-id-16' visibility='default' filepath='src/include/efivar/efivar-types.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='timezone' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='82' column='1'/>
+        <var-decl name='timezone' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-types.h' line='82' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='daylight' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='83' column='1'/>
+        <var-decl name='daylight' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='83' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='120'>
-        <var-decl name='pad2' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='84' column='1'/>
+        <var-decl name='pad2' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='84' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/list.h' line='17' column='1' id='type-id-71'>
+    <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/list.h' line='17' column='1' id='type-id-72'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-72' visibility='default' filepath='src/list.h' line='18' column='1'/>
+        <var-decl name='next' type-id='type-id-73' visibility='default' filepath='src/list.h' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='prev' type-id='type-id-72' visibility='default' filepath='src/list.h' line='19' column='1'/>
+        <var-decl name='prev' type-id='type-id-73' visibility='default' filepath='src/list.h' line='19' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='secdb_alg_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/secdb.h' line='21' column='1' id='type-id-74'>
+    <class-decl name='secdb_alg_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-74' visibility='default' filepath='src/secdb.h' line='21' column='1' id='type-id-75'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='class' type-id='type-id-75' visibility='default' filepath='src/secdb.h' line='22' column='1'/>
+        <var-decl name='class' type-id='type-id-76' visibility='default' filepath='src/secdb.h' line='22' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='src/secdb.h' line='23' column='1'/>
+        <var-decl name='name' type-id='type-id-77' visibility='default' filepath='src/secdb.h' line='23' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='guid' type-id='type-id-2' visibility='default' filepath='src/secdb.h' line='24' column='1'/>
+        <var-decl name='guid' type-id='type-id-78' visibility='default' filepath='src/secdb.h' line='24' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='header_size' type-id='type-id-77' visibility='default' filepath='src/secdb.h' line='25' column='1'/>
+        <var-decl name='header_size' type-id='type-id-79' visibility='default' filepath='src/secdb.h' line='25' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='has_owner' type-id='type-id-78' visibility='default' filepath='src/secdb.h' line='26' column='1'/>
+        <var-decl name='has_owner' type-id='type-id-80' visibility='default' filepath='src/secdb.h' line='26' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='size' type-id='type-id-77' visibility='default' filepath='src/secdb.h' line='27' column='1'/>
+        <var-decl name='size' type-id='type-id-79' visibility='default' filepath='src/secdb.h' line='27' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='FILE' type-id='type-id-40' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-79'/>
-    <typedef-decl name='_IO_lock_t' type-id='type-id-5' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-80'/>
-    <typedef-decl name='__compar_d_fn_t' type-id='type-id-81' filepath='/usr/include/stdlib.h' line='955' column='1' id='type-id-82'/>
-    <typedef-decl name='__int16_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-83'/>
+    <typedef-decl name='FILE' type-id='type-id-40' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-81'/>
+    <typedef-decl name='_IO_lock_t' type-id='type-id-7' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-82'/>
+    <typedef-decl name='__compar_d_fn_t' type-id='type-id-83' filepath='/usr/include/stdlib.h' line='955' column='1' id='type-id-84'/>
+    <typedef-decl name='__int16_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-85'/>
     <typedef-decl name='__off64_t' type-id='type-id-37' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-47'/>
     <typedef-decl name='__off_t' type-id='type-id-37' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-44'/>
-    <typedef-decl name='__uint16_t' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-84'/>
-    <typedef-decl name='__uint64_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-85'/>
-    <typedef-decl name='__uint8_t' type-id='type-id-86' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-87'/>
-    <typedef-decl name='efi_cert_x509_sha256_t' type-id='type-id-52' filepath='src/include/efivar/efisec-types.h' line='42' column='1' id='type-id-51'/>
-    <typedef-decl name='efi_cert_x509_sha384_t' type-id='type-id-56' filepath='src/include/efivar/efisec-types.h' line='47' column='1' id='type-id-55'/>
-    <typedef-decl name='efi_cert_x509_sha512_t' type-id='type-id-59' filepath='src/include/efivar/efisec-types.h' line='52' column='1' id='type-id-58'/>
-    <typedef-decl name='efi_guid_t' type-id='type-id-62' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-61'/>
-    <typedef-decl name='efi_rsa2048_sig_t' type-id='type-id-88' filepath='src/include/efivar/efisec-types.h' line='26' column='1' id='type-id-89'/>
-    <typedef-decl name='efi_secdb_data_t' type-id='type-id-90' filepath='src/include/efivar/efisec-secdb.h' line='29' column='1' id='type-id-91'/>
+    <typedef-decl name='__uint16_t' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-86'/>
+    <typedef-decl name='__uint64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-87'/>
+    <typedef-decl name='__uint8_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-89'/>
+    <typedef-decl name='efi_cert_x509_sha256_t' type-id='type-id-53' filepath='src/include/efivar/efisec-types.h' line='42' column='1' id='type-id-52'/>
+    <typedef-decl name='efi_cert_x509_sha384_t' type-id='type-id-57' filepath='src/include/efivar/efisec-types.h' line='47' column='1' id='type-id-56'/>
+    <typedef-decl name='efi_cert_x509_sha512_t' type-id='type-id-60' filepath='src/include/efivar/efisec-types.h' line='52' column='1' id='type-id-59'/>
+    <typedef-decl name='efi_guid_t' type-id='type-id-63' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-62'/>
+    <typedef-decl name='efi_rsa2048_sig_t' type-id='type-id-90' filepath='src/include/efivar/efisec-types.h' line='26' column='1' id='type-id-91'/>
+    <typedef-decl name='efi_secdb_data_t' type-id='type-id-92' filepath='src/include/efivar/efisec-secdb.h' line='29' column='1' id='type-id-93'/>
     <typedef-decl name='efi_secdb_flag_t' type-id='type-id-30' filepath='src/include/efivar/efisec-secdb.h' line='51' column='1' id='type-id-29'/>
-    <typedef-decl name='efi_secdb_t' type-id='type-id-65' filepath='src/include/efivar/efisec-secdb.h' line='14' column='1' id='type-id-92'/>
+    <typedef-decl name='efi_secdb_t' type-id='type-id-66' filepath='src/include/efivar/efisec-secdb.h' line='14' column='1' id='type-id-94'/>
     <typedef-decl name='efi_secdb_type_t' type-id='type-id-33' filepath='src/include/efivar/efisec-secdb.h' line='45' column='1' id='type-id-32'/>
-    <typedef-decl name='efi_sha1_hash_t' type-id='type-id-93' filepath='src/include/efivar/efisec-types.h' line='21' column='1' id='type-id-94'/>
-    <typedef-decl name='efi_sha224_hash_t' type-id='type-id-95' filepath='src/include/efivar/efisec-types.h' line='22' column='1' id='type-id-96'/>
-    <typedef-decl name='efi_sha256_hash_t' type-id='type-id-97' filepath='src/include/efivar/efisec-types.h' line='23' column='1' id='type-id-53'/>
-    <typedef-decl name='efi_sha384_hash_t' type-id='type-id-98' filepath='src/include/efivar/efisec-types.h' line='24' column='1' id='type-id-57'/>
-    <typedef-decl name='efi_sha512_hash_t' type-id='type-id-99' filepath='src/include/efivar/efisec-types.h' line='25' column='1' id='type-id-60'/>
-    <typedef-decl name='efi_time_t' type-id='type-id-68' filepath='src/include/efivar/efivar-types.h' line='85' column='1' id='type-id-54'/>
-    <typedef-decl name='esl_iter' type-id='type-id-100' filepath='src/esl-iter.h' line='13' column='1' id='type-id-101'/>
+    <typedef-decl name='efi_sha1_hash_t' type-id='type-id-95' filepath='src/include/efivar/efisec-types.h' line='21' column='1' id='type-id-96'/>
+    <typedef-decl name='efi_sha224_hash_t' type-id='type-id-97' filepath='src/include/efivar/efisec-types.h' line='22' column='1' id='type-id-98'/>
+    <typedef-decl name='efi_sha256_hash_t' type-id='type-id-99' filepath='src/include/efivar/efisec-types.h' line='23' column='1' id='type-id-54'/>
+    <typedef-decl name='efi_sha384_hash_t' type-id='type-id-100' filepath='src/include/efivar/efisec-types.h' line='24' column='1' id='type-id-58'/>
+    <typedef-decl name='efi_sha512_hash_t' type-id='type-id-101' filepath='src/include/efivar/efisec-types.h' line='25' column='1' id='type-id-61'/>
+    <typedef-decl name='efi_time_t' type-id='type-id-69' filepath='src/include/efivar/efivar-types.h' line='85' column='1' id='type-id-55'/>
     <typedef-decl name='esl_iter_status_t' type-id='type-id-34' filepath='src/esl-iter.h' line='40' column='1' id='type-id-102'/>
-    <typedef-decl name='int16_t' type-id='type-id-83' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-70'/>
-    <typedef-decl name='intptr_t' type-id='type-id-37' filepath='/usr/include/stdint.h' line='87' column='1' id='type-id-103'/>
-    <typedef-decl name='list_t' type-id='type-id-71' filepath='src/list.h' line='22' column='1' id='type-id-66'/>
-    <typedef-decl name='secdb_alg_t' type-id='type-id-74' filepath='src/secdb.h' line='28' column='1' id='type-id-73'/>
+    <typedef-decl name='int16_t' type-id='type-id-85' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-71'/>
+    <typedef-decl name='intptr_t' type-id='type-id-37' filepath='/usr/include/stdint.h' line='76' column='1' id='type-id-103'/>
+    <typedef-decl name='list_t' type-id='type-id-72' filepath='src/list.h' line='22' column='1' id='type-id-67'/>
+    <typedef-decl name='secdb_alg_t' type-id='type-id-75' filepath='src/secdb.h' line='28' column='1' id='type-id-74'/>
     <typedef-decl name='secdb_entry_class_t' type-id='type-id-36' filepath='src/secdb.h' line='19' column='1' id='type-id-35'/>
-    <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/lib/gcc/x86_64-redhat-linux/13/include/stddef.h' line='214' column='1' id='type-id-12'/>
-    <typedef-decl name='uint16_t' type-id='type-id-84' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-63'/>
-    <typedef-decl name='uint64_t' type-id='type-id-85' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-67'/>
-    <typedef-decl name='uint8_t' type-id='type-id-87' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-69'/>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='160' id='type-id-93'>
-      <subrange length='20' type-id='type-id-22' id='type-id-25'/>
+    <typedef-decl name='size_t' type-id='type-id-11' filepath='/usr/lib/gcc/x86_64-redhat-linux/14/include/stddef.h' line='214' column='1' id='type-id-13'/>
+    <typedef-decl name='uint16_t' type-id='type-id-86' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-64'/>
+    <typedef-decl name='uint64_t' type-id='type-id-87' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-68'/>
+    <typedef-decl name='uint8_t' type-id='type-id-89' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-70'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='160' id='type-id-95'>
+      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-11' id='type-id-25'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='2048' id='type-id-88'>
-      <subrange length='256' type-id='type-id-22' id='type-id-104'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='2048' id='type-id-90'>
+      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-11' id='type-id-104'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='224' id='type-id-95'>
-      <subrange length='28' type-id='type-id-22' id='type-id-105'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='224' id='type-id-97'>
+      <subrange length='28' lower-bound='0' upper-bound='27' type-id='type-id-11' id='type-id-105'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='256' id='type-id-97'>
-      <subrange length='32' type-id='type-id-22' id='type-id-106'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='256' id='type-id-99'>
+      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-11' id='type-id-106'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='384' id='type-id-98'>
-      <subrange length='48' type-id='type-id-22' id='type-id-107'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='384' id='type-id-100'>
+      <subrange length='48' lower-bound='0' upper-bound='47' type-id='type-id-11' id='type-id-107'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='512' id='type-id-99'>
-      <subrange length='64' type-id='type-id-22' id='type-id-108'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='512' id='type-id-101'>
+      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-11' id='type-id-108'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='48' id='type-id-64'>
-      <subrange length='6' type-id='type-id-22' id='type-id-109'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='48' id='type-id-65'>
+      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-11' id='type-id-109'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='infinite' id='type-id-110'>
-      <subrange length='infinite' type-id='type-id-22' id='type-id-111'/>
+    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='unknown' id='type-id-110'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-11' id='type-id-111'/>
     </array-type-def>
-    <union-decl name='efi_secdb_data_t' size-in-bits='2048' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='16' column='1' id='type-id-90'>
+    <union-decl name='efi_secdb_data_t' size-in-bits='2048' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='16' column='1' id='type-id-92'>
       <data-member access='public'>
-        <var-decl name='sha1' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='17' column='1'/>
+        <var-decl name='sha1' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='17' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha224' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='18' column='1'/>
+        <var-decl name='sha224' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='18' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha256' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='19' column='1'/>
+        <var-decl name='sha256' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='19' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha384' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='20' column='1'/>
+        <var-decl name='sha384' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='20' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha512' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='21' column='1'/>
+        <var-decl name='sha512' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='21' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048' type-id='type-id-89' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='22' column='1'/>
+        <var-decl name='rsa2048' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='22' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048_sha1' type-id='type-id-89' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='23' column='1'/>
+        <var-decl name='rsa2048_sha1' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='23' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048_sha256' type-id='type-id-89' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='24' column='1'/>
+        <var-decl name='rsa2048_sha256' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='24' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha256_t' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='25' column='1'/>
+        <var-decl name='x509_sha256_t' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='25' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha384_t' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='26' column='1'/>
+        <var-decl name='x509_sha384_t' type-id='type-id-56' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='26' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha512_t' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='27' column='1'/>
+        <var-decl name='x509_sha512_t' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='27' column='1'/>
       </data-member>
       <data-member access='public'>
         <var-decl name='raw' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='28' column='1'/>
       </data-member>
     </union-decl>
     <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-31'/>
-    <type-decl name='unsigned char' size-in-bits='8' id='type-id-86'/>
-    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
+    <type-decl name='unsigned char' size-in-bits='8' id='type-id-88'/>
+    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>
     <type-decl name='unsigned short int' size-in-bits='16' id='type-id-45'/>
-    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-6'/>
-    <qualified-type-def type-id='type-id-6' restrict='yes' id='type-id-9'/>
+    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-9'/>
     <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-43'/>
-    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-48'/>
-    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-46'/>
-    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-42'/>
-    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-49'/>
-    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-11'/>
-    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-41'/>
-    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-115'/>
-    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-78'/>
-    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-116'/>
-    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-4'/>
-    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-76'/>
-    <qualified-type-def type-id='type-id-4' restrict='yes' id='type-id-10'/>
-    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-117'/>
-    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-2'/>
-    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-26'/>
-    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-75'/>
-    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-77'/>
-    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-118'/>
-    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-119'/>
-    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-120'/>
+    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-50'/>
+    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-10'/>
+    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-41'/>
+    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-112'/>
+    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-80'/>
+    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-113'/>
+    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-6'/>
+    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-77'/>
+    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-4'/>
+    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-78'/>
+    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-26'/>
+    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-76'/>
+    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-79'/>
+    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-114'/>
+    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-115'/>
+    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-116'/>
+    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
+    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-83'/>
+    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-8'/>
+    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
+    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-119'/>
+    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-120'/>
     <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
-    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-122'/>
-    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
-    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-81'/>
-    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-8'/>
-    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
-    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-125'/>
-    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-126'/>
-    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
-    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-13'/>
-    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-128'/>
-    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
-    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
-    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
-    <class-decl name='esl_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-100'/>
-    <type-decl name='variadic parameter type' id='type-id-130'/>
-    <type-decl name='void' id='type-id-5'/>
-    <function-decl name='esl_iter_new' filepath='src/esl-iter.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-123'/>
-      <parameter type-id='type-id-126'/>
-      <parameter type-id='type-id-12'/>
-      <return type-id='type-id-3'/>
+    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-122'/>
+    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
+    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-48'/>
+    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-46'/>
+    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-42'/>
+    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-49'/>
+    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
+    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
+    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
+      <return type-id='type-id-7'/>
     </function-decl>
-    <function-decl name='esl_iter_end' filepath='src/esl-iter.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-122'/>
-      <return type-id='type-id-3'/>
-    </function-decl>
-    <function-decl name='esl_iter_next' filepath='src/esl-iter.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-122'/>
-      <parameter type-id='type-id-118'/>
-      <parameter type-id='type-id-118'/>
-      <parameter type-id='type-id-127'/>
-      <parameter type-id='type-id-125'/>
-      <return type-id='type-id-102'/>
-    </function-decl>
-    <function-decl name='esl_iter_next_with_size_correction' filepath='src/esl-iter.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-122'/>
-      <parameter type-id='type-id-118'/>
-      <parameter type-id='type-id-118'/>
-      <parameter type-id='type-id-127'/>
-      <parameter type-id='type-id-125'/>
-      <parameter type-id='type-id-19'/>
-      <return type-id='type-id-102'/>
-    </function-decl>
-    <function-decl name='esd_get_esl_offset' filepath='src/esl-iter.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-122'/>
-      <return type-id='type-id-103'/>
-    </function-decl>
-    <function-decl name='efi_guid_to_id_guid' filepath='src/include/efivar/efivar.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-2'/>
-      <parameter type-id='type-id-115'/>
-      <return type-id='type-id-3'/>
+    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
+      <return type-id='type-id-7'/>
     </function-decl>
+    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
+    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
+    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
+    <class-decl name='esl_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
+    <typedef-decl name='esl_iter' type-id='type-id-132' filepath='src/esl-iter.h' line='13' column='1' id='type-id-128'/>
+    <var-decl name='efi_guid_sha512' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='19' column='1' elf-symbol-id='efi_guid_sha512'/>
+    <var-decl name='efi_guid_sha224' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='21' column='1' elf-symbol-id='efi_guid_sha224'/>
+    <var-decl name='efi_guid_x509_sha256' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='26' column='1' elf-symbol-id='efi_guid_x509_sha256'/>
+    <var-decl name='efi_guid_rsa2048' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='27' column='1' elf-symbol-id='efi_guid_rsa2048'/>
+    <var-decl name='efi_guid_x509_sha512' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='30' column='1' elf-symbol-id='efi_guid_x509_sha512'/>
+    <var-decl name='efi_guid_rsa2048_sha1' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='36' column='1' elf-symbol-id='efi_guid_rsa2048_sha1'/>
+    <var-decl name='efi_guid_x509_sha384' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='39' column='1' elf-symbol-id='efi_guid_x509_sha384'/>
+    <var-decl name='efi_guid_sha1' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='44' column='1' elf-symbol-id='efi_guid_sha1'/>
+    <var-decl name='efi_guid_sha256' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='52' column='1' elf-symbol-id='efi_guid_sha256'/>
+    <var-decl name='efi_guid_rsa2048_sha256' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='55' column='1' elf-symbol-id='efi_guid_rsa2048_sha256'/>
+    <var-decl name='efi_guid_sha384' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='57' column='1' elf-symbol-id='efi_guid_sha384'/>
     <function-decl name='efi_secdb_new' mangled-name='efi_secdb_new' filepath='src/secdb.c' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_new@@LIBEFISEC_1.38'>
-      <return type-id='type-id-120'/>
+      <return type-id='type-id-116'/>
     </function-decl>
     <function-decl name='efi_secdb_del_entry' mangled-name='efi_secdb_del_entry' filepath='src/secdb.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_del_entry@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-120' name='top' filepath='src/secdb.c' line='132' column='1'/>
-      <parameter type-id='type-id-2' name='owner' filepath='src/secdb.c' line='133' column='1'/>
+      <parameter type-id='type-id-116' name='top' filepath='src/secdb.c' line='132' column='1'/>
+      <parameter type-id='type-id-78' name='owner' filepath='src/secdb.c' line='133' column='1'/>
       <parameter type-id='type-id-32' name='algorithm' filepath='src/secdb.c' line='134' column='1'/>
-      <parameter type-id='type-id-119' name='data' filepath='src/secdb.c' line='135' column='1'/>
-      <parameter type-id='type-id-12' name='datasz' filepath='src/secdb.c' line='136' column='1'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-115' name='data' filepath='src/secdb.c' line='135' column='1'/>
+      <parameter type-id='type-id-13' name='datasz' filepath='src/secdb.c' line='136' column='1'/>
+      <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='efi_secdb_add_entry' mangled-name='efi_secdb_add_entry' filepath='src/secdb.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_add_entry@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-120' name='top' filepath='src/secdb.c' line='289' column='1'/>
-      <parameter type-id='type-id-2' name='owner' filepath='src/secdb.c' line='290' column='1'/>
+      <parameter type-id='type-id-116' name='top' filepath='src/secdb.c' line='289' column='1'/>
+      <parameter type-id='type-id-78' name='owner' filepath='src/secdb.c' line='290' column='1'/>
       <parameter type-id='type-id-32' name='algorithm' filepath='src/secdb.c' line='291' column='1'/>
-      <parameter type-id='type-id-119' name='data' filepath='src/secdb.c' line='292' column='1'/>
-      <parameter type-id='type-id-12' name='datasz' filepath='src/secdb.c' line='293' column='1'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-115' name='data' filepath='src/secdb.c' line='292' column='1'/>
+      <parameter type-id='type-id-13' name='datasz' filepath='src/secdb.c' line='293' column='1'/>
+      <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='efi_secdb_set_bool' mangled-name='efi_secdb_set_bool' filepath='src/secdb.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_set_bool@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-120' name='secdb' filepath='src/secdb.c' line='300' column='1'/>
+      <parameter type-id='type-id-116' name='secdb' filepath='src/secdb.c' line='300' column='1'/>
       <parameter type-id='type-id-29' name='flag' filepath='src/secdb.c' line='300' column='1'/>
-      <parameter type-id='type-id-19' name='value' filepath='src/secdb.c' line='300' column='1'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-20' name='value' filepath='src/secdb.c' line='300' column='1'/>
+      <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='efi_secdb_parse' mangled-name='efi_secdb_parse' filepath='src/secdb.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_parse@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-126' name='data' filepath='src/secdb.c' line='326' column='1'/>
-      <parameter type-id='type-id-12' name='datasz' filepath='src/secdb.c' line='326' column='1'/>
-      <parameter type-id='type-id-121' name='secdbp' filepath='src/secdb.c' line='326' column='1'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-120' name='data' filepath='src/secdb.c' line='326' column='1'/>
+      <parameter type-id='type-id-13' name='datasz' filepath='src/secdb.c' line='326' column='1'/>
+      <parameter type-id='type-id-117' name='secdbp' filepath='src/secdb.c' line='326' column='1'/>
+      <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='efi_secdb_realize' mangled-name='efi_secdb_realize' filepath='src/secdb.c' line='532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_realize@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-120' name='secdb' filepath='src/secdb.c' line='532' column='1'/>
-      <parameter type-id='type-id-128' name='out' filepath='src/secdb.c' line='532' column='1'/>
-      <parameter type-id='type-id-125' name='outsize' filepath='src/secdb.c' line='532' column='1'/>
-      <return type-id='type-id-3'/>
+      <parameter type-id='type-id-116' name='secdb' filepath='src/secdb.c' line='532' column='1'/>
+      <parameter type-id='type-id-122' name='out' filepath='src/secdb.c' line='532' column='1'/>
+      <parameter type-id='type-id-119' name='outsize' filepath='src/secdb.c' line='532' column='1'/>
+      <return type-id='type-id-5'/>
     </function-decl>
     <function-decl name='efi_secdb_free' mangled-name='efi_secdb_free' filepath='src/secdb.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_free@@LIBEFISEC_1.38'>
-      <parameter type-id='type-id-120' name='top' filepath='src/secdb.c' line='585' column='1'/>
-      <return type-id='type-id-5'/>
+      <parameter type-id='type-id-116' name='top' filepath='src/secdb.c' line='585' column='1'/>
+      <return type-id='type-id-7'/>
     </function-decl>
     <var-decl name='efi_secdb_algs_' type-id='type-id-27' mangled-name='efi_secdb_algs_' visibility='default' filepath='src/secdb.h' line='62' column='1' elf-symbol-id='efi_secdb_algs_@@LIBEFISEC_1.38'/>
-    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
-      <parameter type-id='type-id-13'/>
+    <var-decl name='page_size' type-id='type-id-13' visibility='default' filepath='src/util.h' line='204' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-131' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-123'/>
+    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc'>
       <parameter type-id='type-id-12'/>
-      <return type-id='type-id-13'/>
+      <parameter type-id='type-id-11'/>
+      <return type-id='type-id-12'/>
     </function-decl>
-    <function-decl name='qsort_r' filepath='/usr/include/stdlib.h' line='973' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='qsort_r' filepath='/usr/include/stdlib.h' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='qsort_r@@GLIBC_2.8'>
+      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-84'/>
+      <parameter type-id='type-id-12'/>
+      <return type-id='type-id-7'/>
+    </function-decl>
+    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
+      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
