From cd5d91105f0e0fe920cccc1577df42db255152c5 Mon Sep 17 00:00:00 2001
From: Yaakov Selkowitz <yselkowi@redhat.com>
Date: Tue, 24 Jun 2025 19:46:45 -0400
Subject: [PATCH] ABI update after glibc changes

Update the ABI XML files after another glibc change
in struct _IO_FILE

Signed-off-by: Yaakov Selkowitz <yselkowi@redhat.com>
---
 src/libefiboot.abixml | 2122 ++++++++++++++++++-------------------
 src/libefisec.abixml  |  522 +++++-----
 src/libefivar.abixml  | 2310 +++++++++++++++++++++--------------------
 3 files changed, 2486 insertions(+), 2468 deletions(-)

diff --git a/src/libefiboot.abixml b/src/libefiboot.abixml
index 9941210..af27c27 100644
--- a/src/libefiboot.abixml
+++ b/src/libefiboot.abixml
@@ -120,8 +120,8 @@
     <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-7'>
       <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-8'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' hash='99641d293d1da856' id='type-id-9'>
-      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='type-id-10'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-9'>
+      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-10'/>
     </array-type-def>
     <enum-decl name='interface_type' size-in-bits='32' alignment-in-bits='32' filepath='src/linux.h' line='94' column='1' hash='5a03bdd7af684e75' id='type-id-11'>
       <underlying-type type-id='type-id-12'/>
@@ -151,104 +151,110 @@
     <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-13'/>
     <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-14'/>
     <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-15'/>
-    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='50' column='1' hash='a4bd2f88347a2dd0' id='type-id-16'>
+    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='type-id-16'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='_flags' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='52' column='1'/>
+        <var-decl name='_flags' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='53' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='_IO_read_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
+        <var-decl name='_IO_read_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='_IO_read_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
+        <var-decl name='_IO_read_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='_IO_read_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
+        <var-decl name='_IO_read_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='_IO_write_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
+        <var-decl name='_IO_write_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='_IO_write_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
+        <var-decl name='_IO_write_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='_IO_write_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
+        <var-decl name='_IO_write_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='_IO_buf_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
+        <var-decl name='_IO_buf_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='_IO_buf_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
+        <var-decl name='_IO_buf_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='_IO_save_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
+        <var-decl name='_IO_save_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='_IO_backup_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
+        <var-decl name='_IO_backup_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='_IO_save_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
+        <var-decl name='_IO_save_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='_markers' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='69' column='1'/>
+        <var-decl name='_markers' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='_chain' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='71' column='1'/>
+        <var-decl name='_chain' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='_fileno' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
+        <var-decl name='_fileno' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='928'>
-        <var-decl name='_flags2' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
+        <var-decl name='_flags2' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='952'>
-        <var-decl name='_short_backupbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='76' column='1'/>
+        <var-decl name='_short_backupbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
-        <var-decl name='_old_offset' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
+        <var-decl name='_old_offset' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
-        <var-decl name='_cur_column' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='80' column='1'/>
+        <var-decl name='_cur_column' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1040'>
-        <var-decl name='_vtable_offset' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
+        <var-decl name='_vtable_offset' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1048'>
-        <var-decl name='_shortbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
+        <var-decl name='_shortbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='83' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1088'>
-        <var-decl name='_lock' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='84' column='1'/>
+        <var-decl name='_lock' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='85' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1152'>
-        <var-decl name='_offset' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
+        <var-decl name='_offset' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1216'>
-        <var-decl name='_codecvt' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
+        <var-decl name='_codecvt' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1280'>
-        <var-decl name='_wide_data' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
+        <var-decl name='_wide_data' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1344'>
-        <var-decl name='_freeres_list' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
+        <var-decl name='_freeres_list' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1408'>
-        <var-decl name='_freeres_buf' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
+        <var-decl name='_freeres_buf' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1472'>
-        <var-decl name='_prevchain' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
+        <var-decl name='_prevchain' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1536'>
-        <var-decl name='_mode' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
+        <var-decl name='_mode' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='100' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1568'>
-        <var-decl name='_unused2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='101' column='1'/>
+        <var-decl name='_unused3' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='102' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1600'>
+        <var-decl name='_total_written' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='104' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1664'>
+        <var-decl name='_unused2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='109' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-28'>
+    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-29'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='gp_offset' type-id='type-id-29' visibility='default'/>
+        <var-decl name='gp_offset' type-id='type-id-30' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='fp_offset' type-id='type-id-29' visibility='default'/>
+        <var-decl name='fp_offset' type-id='type-id-30' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='overflow_arg_area' type-id='type-id-26' visibility='default'/>
@@ -257,15 +263,15 @@
         <var-decl name='reg_save_area' type-id='type-id-26' visibility='default'/>
       </data-member>
     </class-decl>
-    <class-decl name='acpi_root_info' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/linux.h' line='18' column='1' hash='3e78daf9080337b9' id='type-id-30'>
+    <class-decl name='acpi_root_info' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/linux.h' line='18' column='1' hash='3e78daf9080337b9' id='type-id-31'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='acpi_hid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='19' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='acpi_uid' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='20' column='1'/>
+        <var-decl name='acpi_uid' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='20' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='acpi_cid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='21' column='1'/>
+        <var-decl name='acpi_cid' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <var-decl name='acpi_hid_str' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='22' column='1'/>
@@ -277,49 +283,49 @@
         <var-decl name='acpi_cid_str' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='24' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='ata_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='69' column='1' hash='64228736f48adbeb' id='type-id-33'>
+    <class-decl name='ata_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='69' column='1' hash='64228736f48adbeb' id='type-id-34'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='70' column='1'/>
+        <var-decl name='scsi_bus' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='71' column='1'/>
+        <var-decl name='scsi_device' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='72' column='1'/>
+        <var-decl name='scsi_target' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='73' column='1'/>
+        <var-decl name='scsi_lun' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='73' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='scsi_host' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='75' column='1'/>
+        <var-decl name='scsi_host' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='75' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='dev_probe' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/linux.h' line='329' column='1' hash='e7119e9886ef23f3' id='type-id-34'>
+    <class-decl name='dev_probe' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/linux.h' line='329' column='1' hash='e7119e9886ef23f3' id='type-id-35'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='330' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='iftypes' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='331' column='1'/>
+        <var-decl name='iftypes' type-id='type-id-36' visibility='default' filepath='src/linux.h' line='331' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='332' column='1'/>
+        <var-decl name='flags' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='parse' type-id='type-id-36' visibility='default' filepath='src/linux.h' line='333' column='1'/>
+        <var-decl name='parse' type-id='type-id-37' visibility='default' filepath='src/linux.h' line='333' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='create' type-id='type-id-37' visibility='default' filepath='src/linux.h' line='335' column='1'/>
+        <var-decl name='create' type-id='type-id-38' visibility='default' filepath='src/linux.h' line='335' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='make_part_name' type-id='type-id-38' visibility='default' filepath='src/linux.h' line='337' column='1'/>
+        <var-decl name='make_part_name' type-id='type-id-39' visibility='default' filepath='src/linux.h' line='337' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='device' is-struct='yes' visibility='default' size-in-bits='2752' filepath='src/linux.h' line='107' column='1' hash='dd11a1270a6c3d6a' id='type-id-39'>
+    <class-decl name='device' is-struct='yes' visibility='default' size-in-bits='2752' filepath='src/linux.h' line='107' column='1' hash='dd11a1270a6c3d6a' id='type-id-40'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='interface_type' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='108' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='109' column='1'/>
+        <var-decl name='flags' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='109' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='link' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='110' column='1'/>
@@ -331,38 +337,38 @@
         <var-decl name='driver' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='probes' type-id='type-id-40' visibility='default' filepath='src/linux.h' line='114' column='1'/>
+        <var-decl name='probes' type-id='type-id-41' visibility='default' filepath='src/linux.h' line='114' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='n_probes' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='115' column='1'/>
+        <var-decl name='n_probes' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='115' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='' type-id='type-id-41' visibility='default'/>
+        <var-decl name='' type-id='type-id-42' visibility='default'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_guid_t' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='17' column='1' hash='499ca0d1cb6501b7' id='type-id-43'>
+    <class-decl name='efi_guid_t' is-struct='yes' naming-typedef-id='type-id-43' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='17' column='1' hash='499ca0d1cb6501b7' id='type-id-44'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
+        <var-decl name='a' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
+        <var-decl name='b' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
+        <var-decl name='c' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
+        <var-decl name='d' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
+        <var-decl name='e' type-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='emmc_info' is-struct='yes' visibility='default' size-in-bits='32' filepath='src/linux.h' line='90' column='1' hash='29dbd682339816e4' id='type-id-46'>
+    <class-decl name='emmc_info' is-struct='yes' visibility='default' size-in-bits='32' filepath='src/linux.h' line='90' column='1' hash='29dbd682339816e4' id='type-id-47'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='slot_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='91' column='1'/>
+        <var-decl name='slot_id' type-id='type-id-48' visibility='default' filepath='src/linux.h' line='91' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='mntent' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/mntent.h' line='51' column='1' hash='d7b62e92027a844d' id='type-id-48'>
+    <class-decl name='mntent' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/mntent.h' line='51' column='1' hash='d7b62e92027a844d' id='type-id-49'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='mnt_fsname' type-id='type-id-17' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
       </data-member>
@@ -382,186 +388,186 @@
         <var-decl name='mnt_passno' type-id='type-id-13' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='nvdimm_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='85' column='1' hash='3af1074d5c1f68bb' id='type-id-49'>
+    <class-decl name='nvdimm_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='85' column='1' hash='3af1074d5c1f68bb' id='type-id-50'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='namespace_label' type-id='type-id-42' visibility='default' filepath='src/linux.h' line='86' column='1'/>
+        <var-decl name='namespace_label' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='86' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='nvdimm_label' type-id='type-id-42' visibility='default' filepath='src/linux.h' line='87' column='1'/>
+        <var-decl name='nvdimm_label' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='87' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='nvme_info' is-struct='yes' visibility='default' size-in-bits='160' filepath='src/linux.h' line='78' column='1' hash='8637f0eb758240cf' id='type-id-50'>
+    <class-decl name='nvme_info' is-struct='yes' visibility='default' size-in-bits='160' filepath='src/linux.h' line='78' column='1' hash='8637f0eb758240cf' id='type-id-51'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='ctrl_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='79' column='1'/>
+        <var-decl name='ctrl_id' type-id='type-id-48' visibility='default' filepath='src/linux.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ns_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='80' column='1'/>
+        <var-decl name='ns_id' type-id='type-id-48' visibility='default' filepath='src/linux.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='has_eui' type-id='type-id-13' visibility='default' filepath='src/linux.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='eui' type-id='type-id-51' visibility='default' filepath='src/linux.h' line='82' column='1'/>
+        <var-decl name='eui' type-id='type-id-52' visibility='default' filepath='src/linux.h' line='82' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='pci_dev_info' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/linux.h' line='32' column='1' hash='9f0c0e9249f7388e' id='type-id-52'>
+    <class-decl name='pci_dev_info' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/linux.h' line='32' column='1' hash='9f0c0e9249f7388e' id='type-id-53'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='pci_domain' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='33' column='1'/>
+        <var-decl name='pci_domain' type-id='type-id-45' visibility='default' filepath='src/linux.h' line='33' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='pci_bus' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='34' column='1'/>
+        <var-decl name='pci_bus' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='34' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='24'>
-        <var-decl name='pci_device' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='35' column='1'/>
+        <var-decl name='pci_device' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='35' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pci_function' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='36' column='1'/>
+        <var-decl name='pci_function' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='36' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='driverlink' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='37' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='pci_root_info' is-struct='yes' visibility='default' size-in-bits='32' filepath='src/linux.h' line='27' column='1' hash='4f6a0e9b81077e4c' id='type-id-54'>
+    <class-decl name='pci_root_info' is-struct='yes' visibility='default' size-in-bits='32' filepath='src/linux.h' line='27' column='1' hash='4f6a0e9b81077e4c' id='type-id-55'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='pci_domain' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='28' column='1'/>
+        <var-decl name='pci_domain' type-id='type-id-45' visibility='default' filepath='src/linux.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='pci_bus' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='29' column='1'/>
+        <var-decl name='pci_bus' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='29' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='sas_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='47' column='1' hash='e19495160d0814f6' id='type-id-55'>
+    <class-decl name='sas_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/linux.h' line='47' column='1' hash='e19495160d0814f6' id='type-id-56'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='48' column='1'/>
+        <var-decl name='scsi_bus' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='49' column='1'/>
+        <var-decl name='scsi_device' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='50' column='1'/>
+        <var-decl name='scsi_target' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='51' column='1'/>
+        <var-decl name='scsi_lun' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='53' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='53' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='sata_info' is-struct='yes' visibility='default' size-in-bits='320' filepath='src/linux.h' line='56' column='1' hash='4cfb163f66d411d4' id='type-id-56'>
+    <class-decl name='sata_info' is-struct='yes' visibility='default' size-in-bits='320' filepath='src/linux.h' line='56' column='1' hash='4cfb163f66d411d4' id='type-id-57'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='57' column='1'/>
+        <var-decl name='scsi_bus' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='58' column='1'/>
+        <var-decl name='scsi_device' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='58' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='59' column='1'/>
+        <var-decl name='scsi_target' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='59' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='60' column='1'/>
+        <var-decl name='scsi_lun' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='60' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='ata_devno' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='62' column='1'/>
+        <var-decl name='ata_devno' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='224'>
-        <var-decl name='ata_port' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='63' column='1'/>
+        <var-decl name='ata_port' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='ata_pmp' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='64' column='1'/>
+        <var-decl name='ata_pmp' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='ata_print_id' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='66' column='1'/>
+        <var-decl name='ata_print_id' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='66' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='scsi_info' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/linux.h' line='40' column='1' hash='da59e3a654d4fa8d' id='type-id-57'>
+    <class-decl name='scsi_info' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/linux.h' line='40' column='1' hash='da59e3a654d4fa8d' id='type-id-58'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='41' column='1'/>
+        <var-decl name='scsi_bus' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='41' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='42' column='1'/>
+        <var-decl name='scsi_device' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='42' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='43' column='1'/>
+        <var-decl name='scsi_target' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='43' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='44' column='1'/>
+        <var-decl name='scsi_lun' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='44' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-58'>
+    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-59'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='st_dev' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
+        <var-decl name='st_dev' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='st_ino' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
+        <var-decl name='st_ino' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='st_nlink' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
+        <var-decl name='st_nlink' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='st_mode' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
+        <var-decl name='st_mode' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='224'>
-        <var-decl name='st_uid' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
+        <var-decl name='st_uid' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='st_gid' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
+        <var-decl name='st_gid' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
         <var-decl name='__pad0' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='st_rdev' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
+        <var-decl name='st_rdev' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
         <var-decl name='st_size' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='st_blksize' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
+        <var-decl name='st_blksize' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='st_blocks' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
+        <var-decl name='st_blocks' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='st_atim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
+        <var-decl name='st_atim' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='st_mtim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
+        <var-decl name='st_mtim' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='st_ctim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
+        <var-decl name='st_ctim' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
         <var-decl name='__glibc_reserved' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-67'>
+    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-68'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tv_sec' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
+        <var-decl name='tv_sec' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='tv_nsec' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='2368' is-anonymous='yes' filepath='src/linux.h' line='118' column='1' hash='3847948e543fe426' id='type-id-69'>
+    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='2368' is-anonymous='yes' filepath='src/linux.h' line='118' column='1' hash='3847948e543fe426' id='type-id-70'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='stat' type-id='type-id-58' visibility='default' filepath='src/linux.h' line='119' column='1'/>
+        <var-decl name='stat' type-id='type-id-59' visibility='default' filepath='src/linux.h' line='119' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1152'>
-        <var-decl name='controllernum' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='121' column='1'/>
+        <var-decl name='controllernum' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1184'>
-        <var-decl name='disknum' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='122' column='1'/>
+        <var-decl name='disknum' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='122' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1216'>
         <var-decl name='part' type-id='type-id-13' visibility='default' filepath='src/linux.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1280'>
-        <var-decl name='major' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='124' column='1'/>
+        <var-decl name='major' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='124' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1344'>
-        <var-decl name='minor' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='125' column='1'/>
+        <var-decl name='minor' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='125' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1376'>
-        <var-decl name='edd10_devicenum' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='126' column='1'/>
+        <var-decl name='edd10_devicenum' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='126' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1408'>
         <var-decl name='disk_name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='128' column='1'/>
@@ -570,80 +576,80 @@
         <var-decl name='part_name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='129' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1536'>
-        <var-decl name='acpi_root' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='131' column='1'/>
+        <var-decl name='acpi_root' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='131' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1920'>
-        <var-decl name='pci_root' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='132' column='1'/>
+        <var-decl name='pci_root' type-id='type-id-55' visibility='default' filepath='src/linux.h' line='132' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1952'>
-        <var-decl name='n_pci_devs' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='133' column='1'/>
+        <var-decl name='n_pci_devs' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='133' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1984'>
-        <var-decl name='pci_dev' type-id='type-id-70' visibility='default' filepath='src/linux.h' line='134' column='1'/>
+        <var-decl name='pci_dev' type-id='type-id-71' visibility='default' filepath='src/linux.h' line='134' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2048'>
-        <var-decl name='' type-id='type-id-71' visibility='default'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='FILE' type-id='type-id-16' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-72'/>
-    <typedef-decl name='_IO_lock_t' type-id='type-id-73' filepath='/usr/include/bits/types/struct_FILE.h' line='44' column='1' id='type-id-74'/>
-    <typedef-decl name='__blkcnt_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-66'/>
-    <typedef-decl name='__blksize_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-65'/>
-    <typedef-decl name='__dev_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-59'/>
-    <typedef-decl name='__gid_t' type-id='type-id-29' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-64'/>
-    <typedef-decl name='__ino_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-60'/>
-    <typedef-decl name='__int32_t' type-id='type-id-13' size-in-bits='32' filepath='/usr/include/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-75'/>
-    <typedef-decl name='__mode_t' type-id='type-id-29' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-62'/>
-    <typedef-decl name='__nlink_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-61'/>
+        <var-decl name='' type-id='type-id-72' visibility='default'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='FILE' type-id='type-id-16' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-73'/>
+    <typedef-decl name='_IO_lock_t' type-id='type-id-74' filepath='/usr/include/bits/types/struct_FILE.h' line='45' column='1' id='type-id-75'/>
+    <typedef-decl name='__blkcnt_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-67'/>
+    <typedef-decl name='__blksize_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-66'/>
+    <typedef-decl name='__dev_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-60'/>
+    <typedef-decl name='__gid_t' type-id='type-id-30' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-65'/>
+    <typedef-decl name='__ino_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-61'/>
+    <typedef-decl name='__int32_t' type-id='type-id-13' size-in-bits='32' filepath='/usr/include/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-76'/>
+    <typedef-decl name='__mode_t' type-id='type-id-30' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-63'/>
+    <typedef-decl name='__nlink_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-62'/>
     <typedef-decl name='__off64_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-23'/>
     <typedef-decl name='__off_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-20'/>
-    <typedef-decl name='__ssize_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-76'/>
+    <typedef-decl name='__ssize_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-77'/>
     <typedef-decl name='__syscall_slong_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-1'/>
-    <typedef-decl name='__time_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-68'/>
-    <typedef-decl name='__uid_t' type-id='type-id-29' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-63'/>
-    <typedef-decl name='__uint16_t' type-id='type-id-21' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-77'/>
-    <typedef-decl name='__uint32_t' type-id='type-id-29' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-78'/>
-    <typedef-decl name='__uint64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-79'/>
+    <typedef-decl name='__time_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-69'/>
+    <typedef-decl name='__uid_t' type-id='type-id-30' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-64'/>
+    <typedef-decl name='__uint16_t' type-id='type-id-21' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-78'/>
+    <typedef-decl name='__uint32_t' type-id='type-id-30' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-79'/>
+    <typedef-decl name='__uint64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-28'/>
     <typedef-decl name='__uint8_t' type-id='type-id-80' size-in-bits='8' filepath='/usr/include/bits/types.h' line='38' column='1' hash='6ebac62b3366db68' id='type-id-81'/>
-    <typedef-decl name='efi_guid_t' type-id='type-id-43' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-42'/>
-    <typedef-decl name='int32_t' type-id='type-id-75' size-in-bits='32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-47'/>
-    <typedef-decl name='size_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='type-id-82'/>
-    <typedef-decl name='uint16_t' type-id='type-id-77' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-44'/>
-    <typedef-decl name='uint32_t' type-id='type-id-78' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-31'/>
-    <typedef-decl name='uint64_t' type-id='type-id-79' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-32'/>
-    <typedef-decl name='uint8_t' type-id='type-id-81' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-53'/>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='48' hash='b6435304905fc8f6' id='type-id-45'>
+    <typedef-decl name='efi_guid_t' type-id='type-id-44' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-43'/>
+    <typedef-decl name='int32_t' type-id='type-id-76' size-in-bits='32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-48'/>
+    <typedef-decl name='size_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-82'/>
+    <typedef-decl name='uint16_t' type-id='type-id-78' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-45'/>
+    <typedef-decl name='uint32_t' type-id='type-id-79' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-32'/>
+    <typedef-decl name='uint64_t' type-id='type-id-28' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-33'/>
+    <typedef-decl name='uint8_t' type-id='type-id-81' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-54'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='48' hash='b6435304905fc8f6' id='type-id-46'>
       <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-83'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='64' hash='24c833a0e6bde8ce' id='type-id-51'>
-      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-84'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='64' hash='24c833a0e6bde8ce' id='type-id-52'>
+      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-10'/>
     </array-type-def>
-    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='src/linux.h' line='136' column='1' hash='da65db11d1350db9' id='type-id-71'>
+    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='src/linux.h' line='136' column='1' hash='da65db11d1350db9' id='type-id-72'>
       <data-member access='public'>
-        <var-decl name='scsi_info' type-id='type-id-57' visibility='default' filepath='src/linux.h' line='137' column='1'/>
+        <var-decl name='scsi_info' type-id='type-id-58' visibility='default' filepath='src/linux.h' line='137' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas_info' type-id='type-id-55' visibility='default' filepath='src/linux.h' line='138' column='1'/>
+        <var-decl name='sas_info' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='138' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sata_info' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='139' column='1'/>
+        <var-decl name='sata_info' type-id='type-id-57' visibility='default' filepath='src/linux.h' line='139' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ata_info' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='140' column='1'/>
+        <var-decl name='ata_info' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='140' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvme_info' type-id='type-id-50' visibility='default' filepath='src/linux.h' line='141' column='1'/>
+        <var-decl name='nvme_info' type-id='type-id-51' visibility='default' filepath='src/linux.h' line='141' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='emmc_info' type-id='type-id-46' visibility='default' filepath='src/linux.h' line='142' column='1'/>
+        <var-decl name='emmc_info' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='142' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvdimm_info' type-id='type-id-49' visibility='default' filepath='src/linux.h' line='143' column='1'/>
+        <var-decl name='nvdimm_info' type-id='type-id-50' visibility='default' filepath='src/linux.h' line='143' column='1'/>
       </data-member>
     </union-decl>
-    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='2368' is-anonymous='yes' filepath='src/linux.h' line='117' column='1' hash='f1ed20d2b69fe23e#2' id='type-id-41'>
+    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='2368' is-anonymous='yes' filepath='src/linux.h' line='117' column='1' hash='f1ed20d2b69fe23e#2' id='type-id-42'>
       <data-member access='public'>
-        <var-decl name='' type-id='type-id-69' visibility='default'/>
+        <var-decl name='' type-id='type-id-70' visibility='default'/>
       </data-member>
       <data-member access='public'>
         <var-decl name='ifname' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='146' column='1'/>
@@ -651,105 +657,192 @@
     </union-decl>
     <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-12'/>
     <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-80'/>
-    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-29'/>
+    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-30'/>
     <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-3'/>
     <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-21'/>
-    <pointer-type-def type-id='type-id-72' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-85'/>
+    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-84'/>
     <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-19'/>
     <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='e8c018048121152c' id='type-id-27'/>
-    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-86'/>
+    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-85'/>
     <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-17'/>
-    <pointer-type-def type-id='type-id-87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-38'/>
-    <qualified-type-def type-id='type-id-17' restrict='yes' hash='566dfacc48804f50' id='type-id-88'/>
-    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-89'/>
-    <qualified-type-def type-id='type-id-89' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-90'/>
-    <qualified-type-def type-id='type-id-6' const='yes' hash='3e50fd33f9bb78d9' id='type-id-91'/>
-    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='c44743f354f6a443' id='type-id-92'/>
-    <qualified-type-def type-id='type-id-92' const='yes' hash='ec42cf78a9d93a8c' id='type-id-93'/>
-    <qualified-type-def type-id='type-id-92' restrict='yes' hash='b7d5472019e79b5f' id='type-id-94'/>
-    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='ea8bf672e7d04621' id='type-id-95'/>
-    <pointer-type-def type-id='type-id-95' size-in-bits='64' hash='b2b377b511d32dcd' id='type-id-40'/>
-    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='53a46af13adfaca7' id='type-id-96'/>
-    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-97'/>
-    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='50b5d187d4d66837' id='type-id-35'/>
-    <pointer-type-def type-id='type-id-48' size-in-bits='64' hash='0674698d60236763' id='type-id-98'/>
-    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='ee5f2565d547e0d8' id='type-id-70'/>
-    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-36'/>
-    <pointer-type-def type-id='type-id-100' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-37'/>
-    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='925ad1338878bb49' id='type-id-101'/>
-    <qualified-type-def type-id='type-id-101' restrict='yes' hash='625d51349de39d13' id='type-id-102'/>
-    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='24d8cca8965ce13e' id='type-id-103'/>
-    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
-    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-24'/>
-    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-22'/>
-    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-18'/>
-    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-25'/>
+    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-39'/>
+    <qualified-type-def type-id='type-id-17' restrict='yes' hash='566dfacc48804f50' id='type-id-87'/>
+    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-88'/>
+    <qualified-type-def type-id='type-id-88' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-89'/>
+    <qualified-type-def type-id='type-id-6' const='yes' hash='3e50fd33f9bb78d9' id='type-id-90'/>
+    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='c44743f354f6a443' id='type-id-91'/>
+    <qualified-type-def type-id='type-id-91' const='yes' hash='ec42cf78a9d93a8c' id='type-id-92'/>
+    <qualified-type-def type-id='type-id-91' restrict='yes' hash='b7d5472019e79b5f' id='type-id-93'/>
+    <pointer-type-def type-id='type-id-35' size-in-bits='64' hash='ea8bf672e7d04621' id='type-id-94'/>
+    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='b2b377b511d32dcd' id='type-id-41'/>
+    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='53a46af13adfaca7' id='type-id-95'/>
+    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-96'/>
+    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='50b5d187d4d66837' id='type-id-36'/>
+    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='0674698d60236763' id='type-id-97'/>
+    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='ee5f2565d547e0d8' id='type-id-71'/>
+    <pointer-type-def type-id='type-id-98' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-37'/>
+    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-38'/>
+    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='925ad1338878bb49' id='type-id-100'/>
+    <qualified-type-def type-id='type-id-100' restrict='yes' hash='625d51349de39d13' id='type-id-101'/>
+    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='24d8cca8965ce13e' id='type-id-102'/>
+    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
+    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-24'/>
+    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-22'/>
+    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-18'/>
+    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-25'/>
     <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
-      <return type-id='type-id-73'/>
+      <return type-id='type-id-74'/>
     </function-decl>
     <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
-      <return type-id='type-id-73'/>
+      <return type-id='type-id-74'/>
+    </function-decl>
+    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-105'/>
+    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
+    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-107'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-108'/>
+    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0' hash='c3ec68b77fe0cdaf'>
+      <parameter type-id='type-id-102' name='buf' filepath='src/creator.c' line='318' column='1'/>
+      <parameter type-id='type-id-109' name='size' filepath='src/creator.c' line='318' column='1'/>
+      <parameter type-id='type-id-91' name='devpath' filepath='src/creator.c' line='319' column='1'/>
+      <parameter type-id='type-id-13' name='partition' filepath='src/creator.c' line='319' column='1'/>
+      <parameter type-id='type-id-91' name='relpath' filepath='src/creator.c' line='320' column='1'/>
+      <parameter type-id='type-id-32' name='options' filepath='src/creator.c' line='321' column='1'/>
+      <parameter is-variadic='yes'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0' hash='29c8c87e28d7328f'>
+      <parameter type-id='type-id-102' name='buf' filepath='src/creator.c' line='370' column='1'/>
+      <parameter type-id='type-id-109' name='size' filepath='src/creator.c' line='370' column='1'/>
+      <parameter type-id='type-id-92' name='filepath' filepath='src/creator.c' line='371' column='1'/>
+      <parameter type-id='type-id-32' name='options' filepath='src/creator.c' line='372' column='1'/>
+      <parameter is-variadic='yes'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0' hash='39a5bbe456365610'>
+      <parameter type-id='type-id-102' name='buf' filepath='src/creator.c' line='461' column='1'/>
+      <parameter type-id='type-id-109' name='size' filepath='src/creator.c' line='461' column='1'/>
+      <parameter type-id='type-id-92' name='ifname' filepath='src/creator.c' line='462' column='1'/>
+      <parameter type-id='type-id-92' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
+      <parameter type-id='type-id-92' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
+      <parameter type-id='type-id-92' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
+      <parameter type-id='type-id-92' name='netmask' filepath='src/creator.c' line='466' column='1'/>
+      <parameter type-id='type-id-45' name='local_port' filepath='src/creator.c' line='467' column='1'/>
+      <parameter type-id='type-id-45' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
+      <parameter type-id='type-id-45' name='protocol' filepath='src/creator.c' line='469' column='1'/>
+      <parameter type-id='type-id-54' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31' hash='2bb88322482ae81c'>
+      <return type-id='type-id-32'/>
+    </function-decl>
+    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10' hash='07eca923f855f911'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4' hash='03e6b2de327a64a6'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-13'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file' hash='3ce455c27a41063c'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-17'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
-    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-107'/>
-    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-108'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
-    <typedef-decl name='DIR' type-id='type-id-109' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-104'/>
+    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic' hash='b506cd9ed266061a'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-54'/>
+      <parameter type-id='type-id-54'/>
+      <parameter type-id='type-id-109'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set' hash='70b5b1b837bb6203'>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-91'/>
+      <parameter is-variadic='yes'/>
+      <return type-id='type-id-13'/>
+    </function-decl>
+    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear' hash='7f32ffea222edbe7'>
+      <return type-id='type-id-74'/>
+    </function-decl>
+    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38' hash='388da3fa973fde78'>
+      <parameter type-id='type-id-13'/>
+      <return type-id='type-id-74'/>
+    </function-decl>
+    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile' hash='2c833d407d937488'>
+      <return type-id='type-id-84'/>
+    </function-decl>
+    <typedef-decl name='DIR' type-id='type-id-108' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-103'/>
     <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='388da3fa973fde78'>
-      <parameter type-id='type-id-105'/>
+      <parameter type-id='type-id-104'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
-      <return type-id='type-id-97'/>
+      <return type-id='type-id-96'/>
     </function-decl>
     <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='1d81aff51c388187'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-13'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='setmntent' filepath='/usr/include/mntent.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setmntent' hash='ce3a19dab827954e'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
-      <return type-id='type-id-85'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
+      <return type-id='type-id-84'/>
     </function-decl>
     <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent' hash='91d4bad7dccf9ae4'>
-      <parameter type-id='type-id-85'/>
-      <return type-id='type-id-98'/>
+      <parameter type-id='type-id-84'/>
+      <return type-id='type-id-97'/>
     </function-decl>
     <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endmntent' hash='5ac3795bb1331787'>
-      <parameter type-id='type-id-85'/>
+      <parameter type-id='type-id-84'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
-      <parameter type-id='type-id-85'/>
+    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
+      <parameter type-id='type-id-84'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
-      <parameter type-id='type-id-85'/>
-      <parameter type-id='type-id-92'/>
+    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
+      <parameter type-id='type-id-84'/>
+      <parameter type-id='type-id-91'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf' hash='c4bcbce131b4d300'>
+    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf' hash='c4bcbce131b4d300'>
+      <parameter type-id='type-id-84'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-85'/>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-86'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf' hash='156e512eaea45d1d'>
-      <parameter type-id='type-id-90'/>
-      <parameter type-id='type-id-94'/>
+    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf' hash='156e512eaea45d1d'>
+      <parameter type-id='type-id-89'/>
+      <parameter type-id='type-id-93'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='5ac3795bb1331787'>
-      <parameter type-id='type-id-85'/>
+      <parameter type-id='type-id-84'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
       <parameter type-id='type-id-26'/>
-      <return type-id='type-id-73'/>
+      <return type-id='type-id-74'/>
     </function-decl>
     <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
       <parameter type-id='type-id-26'/>
@@ -765,31 +858,31 @@
     </function-decl>
     <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
       <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-3'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup' hash='bac6a89264ba699c'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <return type-id='type-id-82'/>
     </function-decl>
     <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='5ffe6a576201da98'>
-      <parameter type-id='type-id-94'/>
-      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-101'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
@@ -797,141 +890,65 @@
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink' hash='f237a668886d5b45'>
-      <parameter type-id='type-id-94'/>
-      <parameter type-id='type-id-88'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-87'/>
       <parameter type-id='type-id-82'/>
-      <return type-id='type-id-110'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0' hash='c3ec68b77fe0cdaf'>
-      <parameter type-id='type-id-103' name='buf' filepath='src/creator.c' line='318' column='1'/>
-      <parameter type-id='type-id-110' name='size' filepath='src/creator.c' line='318' column='1'/>
-      <parameter type-id='type-id-92' name='devpath' filepath='src/creator.c' line='319' column='1'/>
-      <parameter type-id='type-id-13' name='partition' filepath='src/creator.c' line='319' column='1'/>
-      <parameter type-id='type-id-92' name='relpath' filepath='src/creator.c' line='320' column='1'/>
-      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='321' column='1'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0' hash='29c8c87e28d7328f'>
-      <parameter type-id='type-id-103' name='buf' filepath='src/creator.c' line='370' column='1'/>
-      <parameter type-id='type-id-110' name='size' filepath='src/creator.c' line='370' column='1'/>
-      <parameter type-id='type-id-93' name='filepath' filepath='src/creator.c' line='371' column='1'/>
-      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='372' column='1'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0' hash='39a5bbe456365610'>
-      <parameter type-id='type-id-103' name='buf' filepath='src/creator.c' line='461' column='1'/>
-      <parameter type-id='type-id-110' name='size' filepath='src/creator.c' line='461' column='1'/>
-      <parameter type-id='type-id-93' name='ifname' filepath='src/creator.c' line='462' column='1'/>
-      <parameter type-id='type-id-93' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
-      <parameter type-id='type-id-93' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
-      <parameter type-id='type-id-93' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
-      <parameter type-id='type-id-93' name='netmask' filepath='src/creator.c' line='466' column='1'/>
-      <parameter type-id='type-id-44' name='local_port' filepath='src/creator.c' line='467' column='1'/>
-      <parameter type-id='type-id-44' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
-      <parameter type-id='type-id-44' name='protocol' filepath='src/creator.c' line='469' column='1'/>
-      <parameter type-id='type-id-53' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31' hash='2bb88322482ae81c'>
-      <return type-id='type-id-31'/>
-    </function-decl>
-    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10' hash='07eca923f855f911'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4' hash='03e6b2de327a64a6'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file' hash='3ce455c27a41063c'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-17'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic' hash='b506cd9ed266061a'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-110'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set' hash='70b5b1b837bb6203'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-92'/>
-      <parameter is-variadic='yes'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear' hash='7f32ffea222edbe7'>
-      <return type-id='type-id-73'/>
-    </function-decl>
-    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38' hash='388da3fa973fde78'>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-73'/>
-    </function-decl>
-    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile' hash='2c833d407d937488'>
-      <return type-id='type-id-85'/>
-    </function-decl>
-    <type-decl name='variadic parameter type' id='type-id-111'/>
-    <type-decl name='void' id='type-id-73'/>
-    <pointer-type-def type-id='type-id-73' id='type-id-26'/>
-    <function-type size-in-bits='64' hash='022dbac11214e427' id='type-id-87'>
-      <parameter type-id='type-id-96'/>
+    <type-decl name='variadic parameter type' id='type-id-110'/>
+    <type-decl name='void' id='type-id-74'/>
+    <pointer-type-def type-id='type-id-74' id='type-id-26'/>
+    <function-type size-in-bits='64' hash='022dbac11214e427' id='type-id-86'>
+      <parameter type-id='type-id-95'/>
       <return type-id='type-id-17'/>
     </function-type>
-    <function-type size-in-bits='64' hash='da346f439cb84928' id='type-id-99'>
-      <parameter type-id='type-id-96'/>
-      <parameter type-id='type-id-93'/>
-      <parameter type-id='type-id-93'/>
-      <return type-id='type-id-110'/>
+    <function-type size-in-bits='64' hash='da346f439cb84928' id='type-id-98'>
+      <parameter type-id='type-id-95'/>
+      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-92'/>
+      <return type-id='type-id-109'/>
     </function-type>
-    <function-type size-in-bits='64' hash='26651fe24de27ca7' id='type-id-100'>
-      <parameter type-id='type-id-96'/>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-110'/>
-      <return type-id='type-id-110'/>
+    <function-type size-in-bits='64' hash='26651fe24de27ca7' id='type-id-99'>
+      <parameter type-id='type-id-95'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-109'/>
+      <return type-id='type-id-109'/>
     </function-type>
   </abi-instr>
   <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
-    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='type-id-112'>
+    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='type-id-111'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tv_sec' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
+        <var-decl name='tv_sec' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tv_usec' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='__suseconds_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='162' column='1' hash='b119fe0931d2ee10' id='type-id-113'/>
-    <typedef-decl name='ssize_t' type-id='type-id-76' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-110'/>
-    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='c6942bb633dc77f9' id='type-id-114'/>
-    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='5f318e120e3d3e21' id='type-id-115'/>
-    <qualified-type-def type-id='type-id-115' restrict='yes' hash='105de60df608a8be' id='type-id-116'/>
-    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='a7b536d51360d693' id='type-id-117'/>
-    <pointer-type-def type-id='type-id-26' size-in-bits='64' hash='473a9667a2856e32' id='type-id-118'/>
-    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
-    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-122'/>
-    <typedef-decl name='DIR' type-id='type-id-121' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-119'/>
+        <var-decl name='tv_usec' type-id='type-id-112' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='__suseconds_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/bits/types.h' line='162' column='1' hash='b119fe0931d2ee10' id='type-id-112'/>
+    <typedef-decl name='ssize_t' type-id='type-id-77' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-109'/>
+    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='c6942bb633dc77f9' id='type-id-113'/>
+    <pointer-type-def type-id='type-id-111' size-in-bits='64' hash='5f318e120e3d3e21' id='type-id-114'/>
+    <qualified-type-def type-id='type-id-114' restrict='yes' hash='105de60df608a8be' id='type-id-115'/>
+    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='a7b536d51360d693' id='type-id-116'/>
+    <pointer-type-def type-id='type-id-26' size-in-bits='64' hash='473a9667a2856e32' id='type-id-117'/>
+    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
+    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-121'/>
+    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd' hash='6522f79156f34f09'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-33'/>
+      <parameter type-id='type-id-33'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-54'/>
+      <parameter type-id='type-id-54'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <typedef-decl name='DIR' type-id='type-id-120' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-118'/>
     <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_memalign' hash='f74641e922c0ae49'>
-      <parameter type-id='type-id-118'/>
+      <parameter type-id='type-id-117'/>
       <parameter type-id='type-id-3'/>
       <parameter type-id='type-id-3'/>
       <return type-id='type-id-13'/>
@@ -944,12 +961,12 @@
     </function-decl>
     <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='5227d00433989f9c'>
       <parameter type-id='type-id-13'/>
-      <parameter type-id='type-id-101'/>
+      <parameter type-id='type-id-100'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gettimeofday' hash='71e4ee281a0f808c'>
-      <parameter type-id='type-id-116'/>
-      <parameter type-id='type-id-122'/>
+      <parameter type-id='type-id-115'/>
+      <parameter type-id='type-id-121'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64' hash='e90b592389225111'>
@@ -962,57 +979,46 @@
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-26'/>
       <parameter type-id='type-id-82'/>
-      <return type-id='type-id-110'/>
+      <return type-id='type-id-109'/>
     </function-decl>
     <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write' hash='e1f135b405ab837f'>
       <parameter type-id='type-id-13'/>
       <parameter type-id='type-id-26'/>
       <parameter type-id='type-id-82'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd' hash='6522f79156f34f09'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-32'/>
-      <parameter type-id='type-id-32'/>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-53'/>
-      <return type-id='type-id-110'/>
+      <return type-id='type-id-109'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='type-id-123'>
-      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='type-id-124'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='type-id-122'>
+      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='type-id-123'/>
     </array-type-def>
-    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' filepath='/usr/include/sys/utsname.h' line='48' column='1' hash='e8c5f4e1269cd961' id='type-id-125'>
+    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' filepath='/usr/include/sys/utsname.h' line='48' column='1' hash='e8c5f4e1269cd961' id='type-id-124'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='sysname' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
+        <var-decl name='sysname' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='520'>
-        <var-decl name='nodename' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
+        <var-decl name='nodename' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1040'>
-        <var-decl name='release' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
+        <var-decl name='release' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1560'>
-        <var-decl name='version' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
+        <var-decl name='version' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2080'>
-        <var-decl name='machine' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
+        <var-decl name='machine' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2600'>
-        <var-decl name='domainname' type-id='type-id-123' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
+        <var-decl name='domainname' type-id='type-id-122' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
       </data-member>
     </class-decl>
-    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='907e6270359c7eb6' id='type-id-126'/>
-    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
-    <typedef-decl name='DIR' type-id='type-id-129' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-127'/>
-    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' filepath='/usr/include/stdio.h' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf' hash='5f03b5b551b5a51f'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
+    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='907e6270359c7eb6' id='type-id-125'/>
+    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
+    <typedef-decl name='DIR' type-id='type-id-128' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-126'/>
+    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' filepath='/usr/include/stdio.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf' hash='5f03b5b551b5a51f'>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
       <parameter is-variadic='yes'/>
       <return type-id='type-id-13'/>
     </function-decl>
@@ -1031,63 +1037,63 @@
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='5024d1665fd35374'>
-      <parameter type-id='type-id-126'/>
+      <parameter type-id='type-id-125'/>
       <return type-id='type-id-13'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
+    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
     <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc' hash='7f32ffea222edbe7'>
-      <return type-id='type-id-73'/>
+      <return type-id='type-id-74'/>
     </function-decl>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
-    <typedef-decl name='DIR' type-id='type-id-132' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-130'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
+    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid' hash='f5a2a9c0c61e24a4'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex' hash='4281f7728a24ab46'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <var-decl name='acpi_root_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='349' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-131' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-129'/>
     <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup' hash='64b4b60cdba4ca37'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-3'/>
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-3'/>
       <return type-id='type-id-82'/>
     </function-decl>
-    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid' hash='f5a2a9c0c61e24a4'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex' hash='4281f7728a24ab46'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <var-decl name='acpi_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='349' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-acpi.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
-    <typedef-decl name='DIR' type-id='type-id-135' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-133'/>
+    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
+    <typedef-decl name='DIR' type-id='type-id-134' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-132'/>
     <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='388da3fa973fde78'>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
-      <parameter type-id='type-id-90'/>
-      <parameter type-id='type-id-94'/>
-      <parameter type-id='type-id-86'/>
+    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
+      <parameter type-id='type-id-89'/>
+      <parameter type-id='type-id-93'/>
+      <parameter type-id='type-id-85'/>
       <return type-id='type-id-13'/>
     </function-decl>
     <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
@@ -1102,134 +1108,134 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-31' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-136'/>
-    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
-    <typedef-decl name='DIR' type-id='type-id-139' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-137'/>
+    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-135'/>
+    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-138'/>
+    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi' hash='8d0fa82e7b25b51b'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-45'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <var-decl name='ata_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='359' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-138' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-136'/>
     <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr' hash='1b0d39e45ce45198'>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-17'/>
     </function-decl>
     <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr' hash='21babdbcb7a34ebe'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-91'/>
       <return type-id='type-id-17'/>
     </function-decl>
-    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi' hash='8d0fa82e7b25b51b'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-44'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <var-decl name='ata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='359' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-142'/>
-    <typedef-decl name='DIR' type-id='type-id-142' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-140'/>
+    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
     <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc' hash='07eca923f855f911'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <var-decl name='emmc_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='360' column='1'/>
+    <var-decl name='emmc_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='360' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-141' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-139'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-145'/>
-    <typedef-decl name='DIR' type-id='type-id-145' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-143'/>
-    <var-decl name='i2o_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='357' column='1'/>
+    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-144'/>
+    <var-decl name='i2o_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='357' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-144' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-142'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-md.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
-    <typedef-decl name='DIR' type-id='type-id-148' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-146'/>
+    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-147'/>
+    <typedef-decl name='DIR' type-id='type-id-147' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-145'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-151'/>
-    <typedef-decl name='DIR' type-id='type-id-151' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-149'/>
-    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='1d81aff51c388187'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-13'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
+    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-150'/>
     <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme' hash='d9a2c0e27704fe63'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-103'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-32'/>
+      <parameter type-id='type-id-102'/>
+      <return type-id='type-id-109'/>
     </function-decl>
     <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38' hash='7f32ffea222edbe7'>
-      <return type-id='type-id-73'/>
+      <return type-id='type-id-74'/>
+    </function-decl>
+    <var-decl name='nvme_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='355' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-150' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-148'/>
+    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='1d81aff51c388187'>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-13'/>
+      <return type-id='type-id-13'/>
     </function-decl>
-    <var-decl name='nvme_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='355' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-154'/>
-    <typedef-decl name='DIR' type-id='type-id-154' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-152'/>
-    <var-decl name='pci_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='348' column='1'/>
+    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-153'/>
+    <var-decl name='pci_root_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='348' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-153' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-151'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-157'/>
-    <typedef-decl name='DIR' type-id='type-id-157' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-155'/>
+    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-156'/>
     <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci' hash='b73f76c73cec0ebf'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-53'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-54'/>
+      <parameter type-id='type-id-54'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <var-decl name='pci_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='352' column='1'/>
+    <var-decl name='pci_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='352' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-156' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-154'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-160'/>
-    <typedef-decl name='DIR' type-id='type-id-160' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-158'/>
-    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
-      <parameter type-id='type-id-92'/>
-      <return type-id='type-id-17'/>
-    </function-decl>
+    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
     <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm' hash='a569643fc7cb3129'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-114'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-113'/>
+      <return type-id='type-id-109'/>
     </function-decl>
     <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid' hash='b0097e728d3a5ab0'>
-      <parameter type-id='type-id-92'/>
-      <parameter type-id='type-id-114'/>
+      <parameter type-id='type-id-91'/>
+      <parameter type-id='type-id-113'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <var-decl name='pmem_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='347' column='1'/>
+    <var-decl name='pmem_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='347' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-159' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-157'/>
+    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
+      <parameter type-id='type-id-91'/>
+      <return type-id='type-id-17'/>
+    </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-163'/>
-    <typedef-decl name='DIR' type-id='type-id-163' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-161'/>
+    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
     <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas' hash='b5a3c136924ec33c'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-32'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-33'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <var-decl name='sas_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='353' column='1'/>
+    <var-decl name='sas_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='353' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-162' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-160'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-164'>
-      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-165'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-163'>
+      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-164'/>
     </array-type-def>
-    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-166'/>
-    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-167'>
+    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-165'/>
+    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-166'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='d_ino' type-id='type-id-168' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
+        <var-decl name='d_ino' type-id='type-id-167' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='d_off' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
@@ -1241,79 +1247,94 @@
         <var-decl name='d_type' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='d_name' type-id='type-id-164' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
+        <var-decl name='d_name' type-id='type-id-163' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='__ino64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-168'/>
-    <typedef-decl name='__int16_t' type-id='type-id-166' size-in-bits='16' filepath='/usr/include/bits/types.h' line='39' column='1' hash='6c2352eccdcd3eea' id='type-id-169'/>
-    <typedef-decl name='int16_t' type-id='type-id-169' size-in-bits='16' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' hash='6c2352eccdcd3eea' id='type-id-170'/>
-    <pointer-type-def type-id='type-id-167' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-171'/>
-    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-174'/>
-    <typedef-decl name='DIR' type-id='type-id-174' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-172'/>
+    <typedef-decl name='__ino64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-167'/>
+    <typedef-decl name='__int16_t' type-id='type-id-165' size-in-bits='16' filepath='/usr/include/bits/types.h' line='39' column='1' hash='6c2352eccdcd3eea' id='type-id-168'/>
+    <typedef-decl name='int16_t' type-id='type-id-168' size-in-bits='16' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' hash='6c2352eccdcd3eea' id='type-id-169'/>
+    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-170'/>
+    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-173'/>
+    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata' hash='6218a14b01b1ebaf'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-169'/>
+      <parameter type-id='type-id-45'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <var-decl name='sata_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='354' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-173' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-171'/>
     <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='53885bde0aa65efe'>
-      <parameter type-id='type-id-92'/>
-      <return type-id='type-id-173'/>
+      <parameter type-id='type-id-91'/>
+      <return type-id='type-id-172'/>
     </function-decl>
     <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='8210c868a3f56bcd'>
-      <parameter type-id='type-id-173'/>
-      <return type-id='type-id-171'/>
+      <parameter type-id='type-id-172'/>
+      <return type-id='type-id-170'/>
     </function-decl>
-    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata' hash='6218a14b01b1ebaf'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-170'/>
-      <parameter type-id='type-id-44'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <var-decl name='sata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='354' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-177'/>
-    <typedef-decl name='DIR' type-id='type-id-177' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-175'/>
+    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-176'/>
     <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi' hash='7050a255ca14152e'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-44'/>
-      <parameter type-id='type-id-44'/>
-      <return type-id='type-id-110'/>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-45'/>
+      <parameter type-id='type-id-45'/>
+      <return type-id='type-id-109'/>
     </function-decl>
-    <var-decl name='scsi_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='358' column='1'/>
+    <var-decl name='scsi_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='358' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-176' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-174'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-180'/>
-    <typedef-decl name='DIR' type-id='type-id-180' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-178'/>
-    <var-decl name='soc_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='350' column='1'/>
+    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-179'/>
+    <var-decl name='soc_root_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='350' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-179' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-177'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
-    <typedef-decl name='DIR' type-id='type-id-183' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-181'/>
-    <var-decl name='virtblk_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='356' column='1'/>
+    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
+    <var-decl name='virtblk_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='356' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-182' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-180'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
-    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-186'/>
-    <typedef-decl name='DIR' type-id='type-id-186' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-184'/>
-    <var-decl name='virtual_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='351' column='1'/>
+    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
+    <var-decl name='virtual_root_parser' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='351' column='1'/>
+    <typedef-decl name='DIR' type-id='type-id-185' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-183'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
-    <typedef-decl name='const_efidp' type-id='type-id-187' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' hash='8183b12658ab99b1' id='type-id-188'/>
-    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-189'/>
-    <qualified-type-def type-id='type-id-190' const='yes' hash='6a235f390cae8715' id='type-id-191'/>
-    <pointer-type-def type-id='type-id-191' size-in-bits='64' hash='8183b12658ab99b1' id='type-id-187'/>
-    <qualified-type-def type-id='type-id-53' const='yes' hash='5a6582fbecdbfc78' id='type-id-192'/>
-    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-193'/>
-    <qualified-type-def type-id='type-id-193' const='yes' hash='5211ca787f6a625f' id='type-id-194'/>
-    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-197'/>
-    <typedef-decl name='DIR' type-id='type-id-197' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-195'/>
+    <typedef-decl name='const_efidp' type-id='type-id-186' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' hash='8183b12658ab99b1' id='type-id-187'/>
+    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-188'/>
+    <qualified-type-def type-id='type-id-189' const='yes' hash='6a235f390cae8715' id='type-id-190'/>
+    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='8183b12658ab99b1' id='type-id-186'/>
+    <qualified-type-def type-id='type-id-54' const='yes' hash='5a6582fbecdbfc78' id='type-id-191'/>
+    <pointer-type-def type-id='type-id-191' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-192'/>
+    <qualified-type-def type-id='type-id-192' const='yes' hash='5211ca787f6a625f' id='type-id-193'/>
+    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-196'/>
+    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr' hash='64bda095715de9e4'>
+      <parameter type-id='type-id-102'/>
+      <parameter type-id='type-id-109'/>
+      <parameter type-id='type-id-54'/>
+      <parameter type-id='type-id-193'/>
+      <parameter type-id='type-id-109'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path' hash='432553564090deee'>
+      <parameter type-id='type-id-197'/>
+      <parameter type-id='type-id-82'/>
+      <parameter type-id='type-id-187'/>
+      <parameter type-id='type-id-109'/>
+      <return type-id='type-id-109'/>
+    </function-decl>
+    <typedef-decl name='DIR' type-id='type-id-196' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-194'/>
     <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
       <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-92'/>
+      <parameter type-id='type-id-91'/>
       <parameter type-id='type-id-3'/>
       <return type-id='type-id-17'/>
     </function-decl>
@@ -1323,1124 +1344,1109 @@
       <parameter type-id='type-id-13'/>
       <return type-id='type-id-13'/>
     </function-decl>
-    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr' hash='64bda095715de9e4'>
-      <parameter type-id='type-id-103'/>
-      <parameter type-id='type-id-110'/>
-      <parameter type-id='type-id-53'/>
-      <parameter type-id='type-id-194'/>
-      <parameter type-id='type-id-110'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
-    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path' hash='432553564090deee'>
-      <parameter type-id='type-id-198'/>
-      <parameter type-id='type-id-82'/>
-      <parameter type-id='type-id-188'/>
-      <parameter type-id='type-id-110'/>
-      <return type-id='type-id-110'/>
-    </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
-    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-199'>
-      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-200'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-198'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-199'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-201' size-in-bits='unknown' hash='19a7bd76e4562e22' id='type-id-202'>
-      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-200'/>
+    <array-type-def dimensions='1' type-id='type-id-200' size-in-bits='unknown' hash='19a7bd76e4562e22' id='type-id-201'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-199'/>
     </array-type-def>
-    <class-decl name='efi_ipv4_addr_t' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='35' column='1' hash='06e09f2ac003723c' id='type-id-204'>
+    <class-decl name='efi_ipv4_addr_t' is-struct='yes' naming-typedef-id='type-id-202' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='35' column='1' hash='06e09f2ac003723c' id='type-id-203'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
+        <var-decl name='addr' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_ipv6_addr_t' is-struct='yes' naming-typedef-id='type-id-206' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='39' column='1' hash='ce461c0a8c6878a7' id='type-id-207'>
+    <class-decl name='efi_ipv6_addr_t' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='39' column='1' hash='ce461c0a8c6878a7' id='type-id-206'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
+        <var-decl name='addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efi_load_option_s' is-struct='yes' visibility='default' size-in-bits='48' filepath='src/loadopt.c' line='17' column='1' hash='5122f4b3b41a2c62' id='type-id-209'>
+    <class-decl name='efi_load_option_s' is-struct='yes' visibility='default' size-in-bits='48' filepath='src/loadopt.c' line='17' column='1' hash='5122f4b3b41a2c62' id='type-id-208'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='attributes' type-id='type-id-31' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
+        <var-decl name='attributes' type-id='type-id-32' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='file_path_list_length' type-id='type-id-44' visibility='default' filepath='src/loadopt.c' line='19' column='1'/>
+        <var-decl name='file_path_list_length' type-id='type-id-45' visibility='default' filepath='src/loadopt.c' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='description' type-id='type-id-210' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
+        <var-decl name='description' type-id='type-id-209' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_1394' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' hash='8544afd2aafea6c4' id='type-id-212'>
+    <class-decl name='efidp_1394' is-struct='yes' naming-typedef-id='type-id-210' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' hash='8544afd2aafea6c4' id='type-id-211'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='guid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
+        <var-decl name='guid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_adr' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' hash='75d0e8e62717b42b' id='type-id-215'>
+    <class-decl name='efidp_acpi_adr' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' hash='75d0e8e62717b42b' id='type-id-214'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
+        <var-decl name='adr' type-id='type-id-215' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_hid' is-struct='yes' naming-typedef-id='type-id-217' visibility='default' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' hash='f05a5786606cbb01' id='type-id-218'>
+    <class-decl name='efidp_acpi_hid' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' hash='f05a5786606cbb01' id='type-id-217'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
+        <var-decl name='hid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
+        <var-decl name='uid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_acpi_hid_ex' is-struct='yes' naming-typedef-id='type-id-219' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' hash='29b2990c41a9b4f0' id='type-id-220'>
+    <class-decl name='efidp_acpi_hid_ex' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' hash='29b2990c41a9b4f0' id='type-id-219'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
+        <var-decl name='hid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
+        <var-decl name='uid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='cid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
+        <var-decl name='cid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='hidstr' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
+        <var-decl name='hidstr' type-id='type-id-198' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_atapi' is-struct='yes' naming-typedef-id='type-id-221' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' hash='d9b48e4e9e80de96' id='type-id-222'>
+    <class-decl name='efidp_atapi' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' hash='d9b48e4e9e80de96' id='type-id-221'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='primary' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
+        <var-decl name='primary' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='slave' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
+        <var-decl name='slave' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
+        <var-decl name='lun' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bios_boot' is-struct='yes' naming-typedef-id='type-id-223' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' hash='9b20103dc7a182eb' id='type-id-224'>
+    <class-decl name='efidp_bios_boot' is-struct='yes' naming-typedef-id='type-id-222' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' hash='9b20103dc7a182eb' id='type-id-223'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='device_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
+        <var-decl name='device_type' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='status' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
+        <var-decl name='status' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='description' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
+        <var-decl name='description' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bmc' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' hash='943de8cd84cab34c' id='type-id-227'>
+    <class-decl name='efidp_bmc' is-struct='yes' naming-typedef-id='type-id-225' visibility='default' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' hash='943de8cd84cab34c' id='type-id-226'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
+        <var-decl name='interface_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='base_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
+        <var-decl name='base_addr' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_bt' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' hash='3d8ecae31af49d99' id='type-id-229'>
+    <class-decl name='efidp_bt' is-struct='yes' naming-typedef-id='type-id-227' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' hash='3d8ecae31af49d99' id='type-id-228'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
+        <var-decl name='addr' type-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_btle' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' hash='52eaff9ff963af14' id='type-id-231'>
+    <class-decl name='efidp_btle' is-struct='yes' naming-typedef-id='type-id-229' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' hash='52eaff9ff963af14' id='type-id-230'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
+        <var-decl name='addr' type-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='addr_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
+        <var-decl name='addr_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_cdrom' is-struct='yes' naming-typedef-id='type-id-232' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' hash='2ac237d180dcc5c5' id='type-id-233'>
+    <class-decl name='efidp_cdrom' is-struct='yes' naming-typedef-id='type-id-231' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' hash='2ac237d180dcc5c5' id='type-id-232'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='boot_catalog_entry' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
+        <var-decl name='boot_catalog_entry' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='partition_rba' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
+        <var-decl name='partition_rba' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='sectors' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
+        <var-decl name='sectors' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_controller' is-struct='yes' naming-typedef-id='type-id-234' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' hash='cf9515f165aacac4' id='type-id-235'>
+    <class-decl name='efidp_controller' is-struct='yes' naming-typedef-id='type-id-233' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' hash='cf9515f165aacac4' id='type-id-234'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='controller' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
+        <var-decl name='controller' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_dns' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' hash='d81b45e96bb460cd' id='type-id-237'>
+    <class-decl name='efidp_dns' is-struct='yes' naming-typedef-id='type-id-235' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' hash='d81b45e96bb460cd' id='type-id-236'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='is_ipv6' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
+        <var-decl name='is_ipv6' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='addrs' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
+        <var-decl name='addrs' type-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_emmc' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' hash='064ef1691332f3bc' id='type-id-239'>
+    <class-decl name='efidp_emmc' is-struct='yes' naming-typedef-id='type-id-237' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' hash='064ef1691332f3bc' id='type-id-238'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
+        <var-decl name='slot' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_fc' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' hash='ced686a5243015d8' id='type-id-241'>
+    <class-decl name='efidp_fc' is-struct='yes' naming-typedef-id='type-id-239' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' hash='ced686a5243015d8' id='type-id-240'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
+        <var-decl name='wwn' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
+        <var-decl name='lun' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_fcex' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' hash='fdd9f398457280d4' id='type-id-243'>
+    <class-decl name='efidp_fcex' is-struct='yes' naming-typedef-id='type-id-241' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' hash='fdd9f398457280d4' id='type-id-242'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
+        <var-decl name='wwn' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_file' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' hash='2a58d2bcdef661c1' id='type-id-245'>
+    <class-decl name='efidp_file' is-struct='yes' naming-typedef-id='type-id-243' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' hash='2a58d2bcdef661c1' id='type-id-244'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='name' type-id='type-id-210' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
+        <var-decl name='name' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_firmware_file' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' hash='740a52927612a4c5' id='type-id-247'>
+    <class-decl name='efidp_firmware_file' is-struct='yes' naming-typedef-id='type-id-245' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' hash='740a52927612a4c5' id='type-id-246'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_firmware_volume' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' hash='b6940d9eaecb7302' id='type-id-249'>
+    <class-decl name='efidp_firmware_volume' is-struct='yes' naming-typedef-id='type-id-247' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' hash='b6940d9eaecb7302' id='type-id-248'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_hd' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' hash='500adc973b4f83f2' id='type-id-251'>
+    <class-decl name='efidp_hd' is-struct='yes' naming-typedef-id='type-id-249' visibility='default' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' hash='500adc973b4f83f2' id='type-id-250'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='partition_number' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
+        <var-decl name='partition_number' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='start' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
+        <var-decl name='start' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='size' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
+        <var-decl name='size' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='signature' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
+        <var-decl name='signature' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='format' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
+        <var-decl name='format' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='signature_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
+        <var-decl name='signature_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_header' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' hash='8bed7d4ae6a96e19' id='type-id-252'>
+    <class-decl name='efidp_header' is-struct='yes' naming-typedef-id='type-id-212' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' hash='8bed7d4ae6a96e19' id='type-id-251'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
+        <var-decl name='type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
+        <var-decl name='subtype' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
+        <var-decl name='length' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_hw_vendor' is-struct='yes' naming-typedef-id='type-id-253' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' hash='62254feea29f4446' id='type-id-254'>
+    <class-decl name='efidp_hw_vendor' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' hash='62254feea29f4446' id='type-id-253'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_i2o' is-struct='yes' naming-typedef-id='type-id-255' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' hash='ab016445bf7b0a85' id='type-id-256'>
+    <class-decl name='efidp_i2o' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' hash='ab016445bf7b0a85' id='type-id-255'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
+        <var-decl name='target' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_infiniband' is-struct='yes' naming-typedef-id='type-id-257' visibility='default' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' hash='7a7174f779eb6615' id='type-id-258'>
+    <class-decl name='efidp_infiniband' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' hash='7a7174f779eb6615' id='type-id-257'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='resource_flags' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
+        <var-decl name='resource_flags' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-259' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='' type-id='type-id-260' visibility='default'/>
+        <var-decl name='' type-id='type-id-259' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='target_port_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
+        <var-decl name='target_port_id' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
+        <var-decl name='device_id' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ipv4_addr' is-struct='yes' naming-typedef-id='type-id-261' visibility='default' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' hash='6553af3521986270' id='type-id-262'>
+    <class-decl name='efidp_ipv4_addr' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' hash='6553af3521986270' id='type-id-261'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
+        <var-decl name='local_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='remote_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
+        <var-decl name='protocol' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-263' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
+        <var-decl name='gateway' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
+        <var-decl name='netmask' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ipv6_addr' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' hash='02c8d2b93351d381' id='type-id-265'>
+    <class-decl name='efidp_ipv6_addr' is-struct='yes' naming-typedef-id='type-id-263' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' hash='02c8d2b93351d381' id='type-id-264'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
+        <var-decl name='local_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='304'>
-        <var-decl name='remote_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
+        <var-decl name='protocol' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='ip_addr_origin' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
+        <var-decl name='ip_addr_origin' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='344'>
-        <var-decl name='prefix_length' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
+        <var-decl name='prefix_length' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='gateway_ipv6_addr' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
+        <var-decl name='gateway_ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_iscsi' is-struct='yes' naming-typedef-id='type-id-266' visibility='default' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' hash='8c2211be2f136161' id='type-id-267'>
+    <class-decl name='efidp_iscsi' is-struct='yes' naming-typedef-id='type-id-265' visibility='default' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' hash='8c2211be2f136161' id='type-id-266'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
+        <var-decl name='protocol' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='options' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
+        <var-decl name='options' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='tpgt' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
+        <var-decl name='tpgt' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
+        <var-decl name='target_name' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_lun' is-struct='yes' naming-typedef-id='type-id-268' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' hash='e54cf8b0a6f0bab5' id='type-id-269'>
+    <class-decl name='efidp_lun' is-struct='yes' naming-typedef-id='type-id-267' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' hash='e54cf8b0a6f0bab5' id='type-id-268'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
+        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_mac_addr' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' hash='fa351eabfeb13867' id='type-id-271'>
+    <class-decl name='efidp_mac_addr' is-struct='yes' naming-typedef-id='type-id-269' visibility='default' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' hash='fa351eabfeb13867' id='type-id-270'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-271' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='if_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
+        <var-decl name='if_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_media_vendor' is-struct='yes' naming-typedef-id='type-id-273' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' hash='d30ec0e0233a9e6a' id='type-id-274'>
+    <class-decl name='efidp_media_vendor' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' hash='d30ec0e0233a9e6a' id='type-id-273'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_mmio' is-struct='yes' naming-typedef-id='type-id-275' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' hash='5d1130b2b90fd17a' id='type-id-276'>
+    <class-decl name='efidp_mmio' is-struct='yes' naming-typedef-id='type-id-274' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' hash='5d1130b2b90fd17a' id='type-id-275'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='memory_type' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
+        <var-decl name='memory_type' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='starting_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
+        <var-decl name='starting_address' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='ending_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
+        <var-decl name='ending_address' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_msg_vendor' is-struct='yes' naming-typedef-id='type-id-277' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' hash='3d3d09ed7bdcfc6c' id='type-id-278'>
+    <class-decl name='efidp_msg_vendor' is-struct='yes' naming-typedef-id='type-id-276' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' hash='3d3d09ed7bdcfc6c' id='type-id-277'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_nvdimm' is-struct='yes' naming-typedef-id='type-id-279' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' hash='f68f8a8ba35971ac' id='type-id-280'>
+    <class-decl name='efidp_nvdimm' is-struct='yes' naming-typedef-id='type-id-278' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' hash='f68f8a8ba35971ac' id='type-id-279'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uuid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
+        <var-decl name='uuid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_nvme' is-struct='yes' naming-typedef-id='type-id-281' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' hash='7266005b40c2b239' id='type-id-282'>
+    <class-decl name='efidp_nvme' is-struct='yes' naming-typedef-id='type-id-280' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' hash='7266005b40c2b239' id='type-id-281'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='namespace_id' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
+        <var-decl name='namespace_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='ieee_eui_64' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
+        <var-decl name='ieee_eui_64' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_pccard' is-struct='yes' naming-typedef-id='type-id-283' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' hash='76864c2dbba27f52' id='type-id-284'>
+    <class-decl name='efidp_pccard' is-struct='yes' naming-typedef-id='type-id-282' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' hash='76864c2dbba27f52' id='type-id-283'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
+        <var-decl name='function' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_pci' is-struct='yes' naming-typedef-id='type-id-285' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' hash='bf4270d0b234e04c' id='type-id-286'>
+    <class-decl name='efidp_pci' is-struct='yes' naming-typedef-id='type-id-284' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' hash='bf4270d0b234e04c' id='type-id-285'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
+        <var-decl name='function' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='device' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
+        <var-decl name='device' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_protocol' is-struct='yes' naming-typedef-id='type-id-287' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' hash='0e9283dad46f6b4d' id='type-id-288'>
+    <class-decl name='efidp_protocol' is-struct='yes' naming-typedef-id='type-id-286' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' hash='0e9283dad46f6b4d' id='type-id-287'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
+        <var-decl name='protocol_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ramdisk' is-struct='yes' naming-typedef-id='type-id-289' visibility='default' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' hash='915026c28973b548' id='type-id-290'>
+    <class-decl name='efidp_ramdisk' is-struct='yes' naming-typedef-id='type-id-288' visibility='default' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' hash='915026c28973b548' id='type-id-289'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='start_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
+        <var-decl name='start_addr' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='end_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
+        <var-decl name='end_addr' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='disk_type_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
+        <var-decl name='disk_type_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='instance_number' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
+        <var-decl name='instance_number' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_relative_offset' is-struct='yes' naming-typedef-id='type-id-291' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' hash='86db1d650c6b12a5' id='type-id-292'>
+    <class-decl name='efidp_relative_offset' is-struct='yes' naming-typedef-id='type-id-290' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' hash='86db1d650c6b12a5' id='type-id-291'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='first_byte' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
+        <var-decl name='first_byte' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='last_byte' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
+        <var-decl name='last_byte' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sas' is-struct='yes' naming-typedef-id='type-id-293' visibility='default' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' hash='a7ddda3ae9ac9409' id='type-id-294'>
+    <class-decl name='efidp_sas' is-struct='yes' naming-typedef-id='type-id-292' visibility='default' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' hash='a7ddda3ae9ac9409' id='type-id-293'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
+        <var-decl name='lun' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_topology_info' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='drive_bay_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
+        <var-decl name='rtp' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sas_ex' is-struct='yes' naming-typedef-id='type-id-295' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' hash='b7dbda6eb2aaf21a' id='type-id-296'>
+    <class-decl name='efidp_sas_ex' is-struct='yes' naming-typedef-id='type-id-294' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' hash='b7dbda6eb2aaf21a' id='type-id-295'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='sas_address' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='device_topology_info' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='168'>
-        <var-decl name='drive_bay_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='176'>
-        <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
+        <var-decl name='rtp' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sata' is-struct='yes' naming-typedef-id='type-id-297' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' hash='4e06f84c3eccdf80' id='type-id-298'>
+    <class-decl name='efidp_sata' is-struct='yes' naming-typedef-id='type-id-296' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' hash='4e06f84c3eccdf80' id='type-id-297'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hba_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
+        <var-decl name='hba_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='port_multiplier_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
+        <var-decl name='port_multiplier_port' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
+        <var-decl name='lun' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_scsi' is-struct='yes' naming-typedef-id='type-id-299' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' hash='a57bbdd0ad8cce62' id='type-id-300'>
+    <class-decl name='efidp_scsi' is-struct='yes' naming-typedef-id='type-id-298' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' hash='a57bbdd0ad8cce62' id='type-id-299'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
+        <var-decl name='target' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
+        <var-decl name='lun' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_sd' is-struct='yes' naming-typedef-id='type-id-301' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' hash='c5b3811e3ec32dd9' id='type-id-302'>
+    <class-decl name='efidp_sd' is-struct='yes' naming-typedef-id='type-id-300' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' hash='c5b3811e3ec32dd9' id='type-id-301'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot_number' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
+        <var-decl name='slot_number' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uart' is-struct='yes' naming-typedef-id='type-id-303' visibility='default' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' hash='0443805f2b07cf8e' id='type-id-304'>
+    <class-decl name='efidp_uart' is-struct='yes' naming-typedef-id='type-id-302' visibility='default' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' hash='0443805f2b07cf8e' id='type-id-303'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
+        <var-decl name='reserved' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='baud_rate' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
+        <var-decl name='baud_rate' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='data_bits' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
+        <var-decl name='data_bits' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='136'>
-        <var-decl name='parity' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
+        <var-decl name='parity' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='stop_bits' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
+        <var-decl name='stop_bits' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uart_flow_control' is-struct='yes' naming-typedef-id='type-id-305' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' hash='bddccc1608b5a3af' id='type-id-306'>
+    <class-decl name='efidp_uart_flow_control' is-struct='yes' naming-typedef-id='type-id-304' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' hash='bddccc1608b5a3af' id='type-id-305'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='flow_control_map' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
+        <var-decl name='flow_control_map' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_ufs' is-struct='yes' naming-typedef-id='type-id-307' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' hash='e481220be92dac0d' id='type-id-308'>
+    <class-decl name='efidp_ufs' is-struct='yes' naming-typedef-id='type-id-306' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' hash='e481220be92dac0d' id='type-id-307'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
+        <var-decl name='target_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
+        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_uri' is-struct='yes' naming-typedef-id='type-id-309' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' hash='a1f6bf871f5656f3' id='type-id-310'>
+    <class-decl name='efidp_uri' is-struct='yes' naming-typedef-id='type-id-308' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' hash='a1f6bf871f5656f3' id='type-id-309'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
+        <var-decl name='uri' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb' is-struct='yes' naming-typedef-id='type-id-311' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' hash='69ba10b704e1d6fa' id='type-id-312'>
+    <class-decl name='efidp_usb' is-struct='yes' naming-typedef-id='type-id-310' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' hash='69ba10b704e1d6fa' id='type-id-311'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='parent_port' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
+        <var-decl name='parent_port' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='interface' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
+        <var-decl name='interface' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb_class' is-struct='yes' naming-typedef-id='type-id-313' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' hash='04d52521607f7783' id='type-id-314'>
+    <class-decl name='efidp_usb_class' is-struct='yes' naming-typedef-id='type-id-312' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' hash='04d52521607f7783' id='type-id-313'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='product_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
+        <var-decl name='product_id' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='device_class' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
+        <var-decl name='device_class' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='72'>
-        <var-decl name='device_subclass' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
+        <var-decl name='device_subclass' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='device_protocol' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
+        <var-decl name='device_protocol' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_usb_wwid' is-struct='yes' naming-typedef-id='type-id-315' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' hash='7b7cd9f4d8ad2c99' id='type-id-316'>
+    <class-decl name='efidp_usb_wwid' is-struct='yes' naming-typedef-id='type-id-314' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' hash='7b7cd9f4d8ad2c99' id='type-id-315'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
+        <var-decl name='interface' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='vendor_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='product_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
+        <var-decl name='product_id' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-210' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_vlan' is-struct='yes' naming-typedef-id='type-id-317' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' hash='627f0a8e48e4c38d' id='type-id-318'>
+    <class-decl name='efidp_vlan' is-struct='yes' naming-typedef-id='type-id-316' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' hash='627f0a8e48e4c38d' id='type-id-317'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vlan_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
+        <var-decl name='vlan_id' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='efidp_wifi' is-struct='yes' naming-typedef-id='type-id-319' visibility='default' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' hash='655741e75268fa66' id='type-id-320'>
+    <class-decl name='efidp_wifi' is-struct='yes' naming-typedef-id='type-id-318' visibility='default' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' hash='655741e75268fa66' id='type-id-319'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
+        <var-decl name='ssid' type-id='type-id-271' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' hash='91ff375fdb83a6da#2' id='type-id-321'>
+    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' hash='91ff375fdb83a6da#2' id='type-id-320'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
+        <var-decl name='type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
+        <var-decl name='subtype' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='efi_ip_addr_t' type-id='type-id-322' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-201'/>
-    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-204' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-203'/>
-    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-207' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-206'/>
-    <typedef-decl name='efi_load_option' type-id='type-id-209' size-in-bits='48' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-323'/>
-    <typedef-decl name='efidp' type-id='type-id-324' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' hash='de702e35ca2a7687' id='type-id-325'/>
-    <typedef-decl name='efidp_1394' type-id='type-id-212' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-211'/>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-215' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-214'/>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-218' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-217'/>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-220' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-219'/>
-    <typedef-decl name='efidp_atapi' type-id='type-id-222' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-221'/>
-    <typedef-decl name='efidp_bios_boot' type-id='type-id-224' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-223'/>
-    <typedef-decl name='efidp_bmc' type-id='type-id-227' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-226'/>
-    <typedef-decl name='efidp_boolean' type-id='type-id-53' size-in-bits='8' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' hash='6ebac62b3366db68' id='type-id-263'/>
-    <typedef-decl name='efidp_bt' type-id='type-id-229' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-228'/>
-    <typedef-decl name='efidp_btle' type-id='type-id-231' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-230'/>
-    <typedef-decl name='efidp_cdrom' type-id='type-id-233' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-232'/>
-    <typedef-decl name='efidp_controller' type-id='type-id-235' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-234'/>
-    <typedef-decl name='efidp_data' type-id='type-id-326' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-190'/>
-    <typedef-decl name='efidp_dns' type-id='type-id-237' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-236'/>
-    <typedef-decl name='efidp_emmc' type-id='type-id-239' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-238'/>
-    <typedef-decl name='efidp_fc' type-id='type-id-241' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-240'/>
-    <typedef-decl name='efidp_fcex' type-id='type-id-243' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-242'/>
-    <typedef-decl name='efidp_file' type-id='type-id-245' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-244'/>
-    <typedef-decl name='efidp_firmware_file' type-id='type-id-247' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-246'/>
-    <typedef-decl name='efidp_firmware_volume' type-id='type-id-249' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-248'/>
-    <typedef-decl name='efidp_hd' type-id='type-id-251' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-250'/>
-    <typedef-decl name='efidp_header' type-id='type-id-252' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-213'/>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-254' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-253'/>
-    <typedef-decl name='efidp_i2o' type-id='type-id-256' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-255'/>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-258' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-257'/>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-262' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-261'/>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-265' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-264'/>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-267' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-266'/>
-    <typedef-decl name='efidp_lun' type-id='type-id-269' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-268'/>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-271' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-270'/>
-    <typedef-decl name='efidp_media_vendor' type-id='type-id-274' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-273'/>
-    <typedef-decl name='efidp_mmio' type-id='type-id-276' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-275'/>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-278' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-277'/>
-    <typedef-decl name='efidp_nvdimm' type-id='type-id-280' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-279'/>
-    <typedef-decl name='efidp_nvme' type-id='type-id-282' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-281'/>
-    <typedef-decl name='efidp_pccard' type-id='type-id-284' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-283'/>
-    <typedef-decl name='efidp_pci' type-id='type-id-286' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-285'/>
-    <typedef-decl name='efidp_protocol' type-id='type-id-288' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-287'/>
-    <typedef-decl name='efidp_ramdisk' type-id='type-id-290' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-289'/>
-    <typedef-decl name='efidp_relative_offset' type-id='type-id-292' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-291'/>
-    <typedef-decl name='efidp_sas' type-id='type-id-294' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-293'/>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-296' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-295'/>
-    <typedef-decl name='efidp_sata' type-id='type-id-298' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-297'/>
-    <typedef-decl name='efidp_scsi' type-id='type-id-300' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-299'/>
-    <typedef-decl name='efidp_sd' type-id='type-id-302' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-301'/>
-    <typedef-decl name='efidp_uart' type-id='type-id-304' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-303'/>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-306' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-305'/>
-    <typedef-decl name='efidp_ufs' type-id='type-id-308' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-307'/>
-    <typedef-decl name='efidp_uri' type-id='type-id-310' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-309'/>
-    <typedef-decl name='efidp_usb' type-id='type-id-312' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-311'/>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-314' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-313'/>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-316' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-315'/>
-    <typedef-decl name='efidp_vlan' type-id='type-id-318' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-317'/>
-    <typedef-decl name='efidp_wifi' type-id='type-id-320' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-319'/>
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='unknown' hash='8995f724b5995f66' id='type-id-210'>
-      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-200'/>
+        <var-decl name='length' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='efi_ip_addr_t' type-id='type-id-321' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-200'/>
+    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-203' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-202'/>
+    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-206' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-205'/>
+    <typedef-decl name='efi_load_option' type-id='type-id-208' size-in-bits='48' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-322'/>
+    <typedef-decl name='efidp' type-id='type-id-323' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' hash='de702e35ca2a7687' id='type-id-324'/>
+    <typedef-decl name='efidp_1394' type-id='type-id-211' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-210'/>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-214' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-213'/>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-217' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-216'/>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-219' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-218'/>
+    <typedef-decl name='efidp_atapi' type-id='type-id-221' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-220'/>
+    <typedef-decl name='efidp_bios_boot' type-id='type-id-223' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-222'/>
+    <typedef-decl name='efidp_bmc' type-id='type-id-226' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-225'/>
+    <typedef-decl name='efidp_boolean' type-id='type-id-54' size-in-bits='8' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' hash='6ebac62b3366db68' id='type-id-262'/>
+    <typedef-decl name='efidp_bt' type-id='type-id-228' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-227'/>
+    <typedef-decl name='efidp_btle' type-id='type-id-230' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-229'/>
+    <typedef-decl name='efidp_cdrom' type-id='type-id-232' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-231'/>
+    <typedef-decl name='efidp_controller' type-id='type-id-234' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-233'/>
+    <typedef-decl name='efidp_data' type-id='type-id-325' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-189'/>
+    <typedef-decl name='efidp_dns' type-id='type-id-236' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-235'/>
+    <typedef-decl name='efidp_emmc' type-id='type-id-238' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-237'/>
+    <typedef-decl name='efidp_fc' type-id='type-id-240' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-239'/>
+    <typedef-decl name='efidp_fcex' type-id='type-id-242' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-241'/>
+    <typedef-decl name='efidp_file' type-id='type-id-244' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-243'/>
+    <typedef-decl name='efidp_firmware_file' type-id='type-id-246' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-245'/>
+    <typedef-decl name='efidp_firmware_volume' type-id='type-id-248' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-247'/>
+    <typedef-decl name='efidp_hd' type-id='type-id-250' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-249'/>
+    <typedef-decl name='efidp_header' type-id='type-id-251' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-212'/>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-253' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-252'/>
+    <typedef-decl name='efidp_i2o' type-id='type-id-255' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-254'/>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-257' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-256'/>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-261' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-260'/>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-264' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-263'/>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-266' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-265'/>
+    <typedef-decl name='efidp_lun' type-id='type-id-268' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-267'/>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-270' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-269'/>
+    <typedef-decl name='efidp_media_vendor' type-id='type-id-273' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-272'/>
+    <typedef-decl name='efidp_mmio' type-id='type-id-275' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-274'/>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-277' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-276'/>
+    <typedef-decl name='efidp_nvdimm' type-id='type-id-279' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-278'/>
+    <typedef-decl name='efidp_nvme' type-id='type-id-281' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-280'/>
+    <typedef-decl name='efidp_pccard' type-id='type-id-283' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-282'/>
+    <typedef-decl name='efidp_pci' type-id='type-id-285' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-284'/>
+    <typedef-decl name='efidp_protocol' type-id='type-id-287' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-286'/>
+    <typedef-decl name='efidp_ramdisk' type-id='type-id-289' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-288'/>
+    <typedef-decl name='efidp_relative_offset' type-id='type-id-291' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-290'/>
+    <typedef-decl name='efidp_sas' type-id='type-id-293' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-292'/>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-295' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-294'/>
+    <typedef-decl name='efidp_sata' type-id='type-id-297' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-296'/>
+    <typedef-decl name='efidp_scsi' type-id='type-id-299' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-298'/>
+    <typedef-decl name='efidp_sd' type-id='type-id-301' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-300'/>
+    <typedef-decl name='efidp_uart' type-id='type-id-303' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-302'/>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-305' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-304'/>
+    <typedef-decl name='efidp_ufs' type-id='type-id-307' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-306'/>
+    <typedef-decl name='efidp_uri' type-id='type-id-309' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-308'/>
+    <typedef-decl name='efidp_usb' type-id='type-id-311' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-310'/>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-313' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-312'/>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-315' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-314'/>
+    <typedef-decl name='efidp_vlan' type-id='type-id-317' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-316'/>
+    <typedef-decl name='efidp_wifi' type-id='type-id-319' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-318'/>
+    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='unknown' hash='8995f724b5995f66' id='type-id-209'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-199'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' hash='54581fe115faa565' id='type-id-327'>
-      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-328'/>
+    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' hash='54581fe115faa565' id='type-id-326'>
+      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-327'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='unknown' hash='d71ea9da2a27c259' id='type-id-216'>
-      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-200'/>
+    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='unknown' hash='d71ea9da2a27c259' id='type-id-215'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-199'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' hash='cedf16acf4bd1010' id='type-id-259'>
-      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-329'/>
+    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' hash='cedf16acf4bd1010' id='type-id-258'>
+      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-328'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='type-id-208'>
-      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-330'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='type-id-207'>
+      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-329'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='256' hash='037c09e5626cce93' id='type-id-272'>
-      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-331'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='256' hash='037c09e5626cce93' id='type-id-271'>
+      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-330'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='32' hash='7df313b77e5f7cf4' id='type-id-205'>
-      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-328'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='32' hash='7df313b77e5f7cf4' id='type-id-204'>
+      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-327'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='unknown' hash='953f9801eb087566' id='type-id-225'>
-      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-200'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='unknown' hash='953f9801eb087566' id='type-id-224'>
+      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-199'/>
     </array-type-def>
-    <union-decl name='efi_ip_addr_t' naming-typedef-id='type-id-201' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='43' column='1' hash='dff3fd51392f9298' id='type-id-322'>
+    <union-decl name='efi_ip_addr_t' naming-typedef-id='type-id-200' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='43' column='1' hash='dff3fd51392f9298' id='type-id-321'>
       <data-member access='public'>
-        <var-decl name='addr' type-id='type-id-327' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
+        <var-decl name='addr' type-id='type-id-326' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v4' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
+        <var-decl name='v4' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v6' type-id='type-id-206' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
+        <var-decl name='v6' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
       </data-member>
     </union-decl>
-    <union-decl name='efidp_data' naming-typedef-id='type-id-190' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' hash='13b976cb49d0c85b' id='type-id-326'>
+    <union-decl name='efidp_data' naming-typedef-id='type-id-189' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' hash='13b976cb49d0c85b' id='type-id-325'>
       <data-member access='public'>
-        <var-decl name='' type-id='type-id-321' visibility='default'/>
+        <var-decl name='' type-id='type-id-320' visibility='default'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='header' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
+        <var-decl name='header' type-id='type-id-212' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pci' type-id='type-id-285' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
+        <var-decl name='pci' type-id='type-id-284' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pccard' type-id='type-id-283' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
+        <var-decl name='pccard' type-id='type-id-282' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mmio' type-id='type-id-275' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
+        <var-decl name='mmio' type-id='type-id-274' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hw_vendor' type-id='type-id-253' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
+        <var-decl name='hw_vendor' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='controller' type-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
+        <var-decl name='controller' type-id='type-id-233' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bmc' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
+        <var-decl name='bmc' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid' type-id='type-id-217' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid_ex' type-id='type-id-219' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
+        <var-decl name='acpi_hid_ex' type-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_adr' type-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
+        <var-decl name='acpi_adr' type-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='atapi' type-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
+        <var-decl name='atapi' type-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='scsi' type-id='type-id-299' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
+        <var-decl name='scsi' type-id='type-id-298' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fc' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
+        <var-decl name='fc' type-id='type-id-239' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fcex' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
+        <var-decl name='fcex' type-id='type-id-241' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firewire' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
+        <var-decl name='firewire' type-id='type-id-210' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb' type-id='type-id-311' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
+        <var-decl name='usb' type-id='type-id-310' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_class' type-id='type-id-313' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
+        <var-decl name='usb_class' type-id='type-id-312' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_wwid' type-id='type-id-315' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
+        <var-decl name='usb_wwid' type-id='type-id-314' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='lun' type-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
+        <var-decl name='lun' type-id='type-id-267' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sata' type-id='type-id-297' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
+        <var-decl name='sata' type-id='type-id-296' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='i2o' type-id='type-id-255' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
+        <var-decl name='i2o' type-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mac_addr' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-269' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv4_addr' type-id='type-id-261' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
+        <var-decl name='ipv4_addr' type-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv6_addr' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
+        <var-decl name='ipv6_addr' type-id='type-id-263' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='vlan' type-id='type-id-317' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
+        <var-decl name='vlan' type-id='type-id-316' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='infiniband' type-id='type-id-257' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
+        <var-decl name='infiniband' type-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart' type-id='type-id-303' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
+        <var-decl name='uart' type-id='type-id-302' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='msg_vendor' type-id='type-id-277' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
+        <var-decl name='msg_vendor' type-id='type-id-276' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart_flow_control' type-id='type-id-305' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
+        <var-decl name='uart_flow_control' type-id='type-id-304' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas' type-id='type-id-293' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
+        <var-decl name='sas' type-id='type-id-292' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas_ex' type-id='type-id-295' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
+        <var-decl name='sas_ex' type-id='type-id-294' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='iscsi' type-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
+        <var-decl name='iscsi' type-id='type-id-265' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvme' type-id='type-id-281' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
+        <var-decl name='nvme' type-id='type-id-280' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uri' type-id='type-id-309' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
+        <var-decl name='uri' type-id='type-id-308' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ufs' type-id='type-id-307' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
+        <var-decl name='ufs' type-id='type-id-306' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sd' type-id='type-id-301' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
+        <var-decl name='sd' type-id='type-id-300' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bt' type-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
+        <var-decl name='bt' type-id='type-id-227' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='wifi' type-id='type-id-319' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
+        <var-decl name='wifi' type-id='type-id-318' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='emmc' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
+        <var-decl name='emmc' type-id='type-id-237' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='btle' type-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
+        <var-decl name='btle' type-id='type-id-229' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='dns' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
+        <var-decl name='dns' type-id='type-id-235' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvdimm' type-id='type-id-279' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
+        <var-decl name='nvdimm' type-id='type-id-278' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hd' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
+        <var-decl name='hd' type-id='type-id-249' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='cdrom' type-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
+        <var-decl name='cdrom' type-id='type-id-231' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='media_vendor' type-id='type-id-273' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
+        <var-decl name='media_vendor' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='file' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
+        <var-decl name='file' type-id='type-id-243' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='protocol' type-id='type-id-287' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
+        <var-decl name='protocol' type-id='type-id-286' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_file' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
+        <var-decl name='firmware_file' type-id='type-id-245' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_volume' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
+        <var-decl name='firmware_volume' type-id='type-id-247' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='relative_offset' type-id='type-id-291' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
+        <var-decl name='relative_offset' type-id='type-id-290' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ramdisk' type-id='type-id-289' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
+        <var-decl name='ramdisk' type-id='type-id-288' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bios_boot' type-id='type-id-223' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
+        <var-decl name='bios_boot' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
       </data-member>
     </union-decl>
-    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' hash='0d901b21ae545901#3' id='type-id-260'>
+    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' hash='0d901b21ae545901#3' id='type-id-259'>
       <data-member access='public'>
-        <var-decl name='ioc_guid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
+        <var-decl name='ioc_guid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='service_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
+        <var-decl name='service_id' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
       </data-member>
     </union-decl>
-    <qualified-type-def type-id='type-id-85' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-332'/>
-    <qualified-type-def type-id='type-id-80' const='yes' hash='645f4d0d44563fc6' id='type-id-333'/>
-    <pointer-type-def type-id='type-id-333' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-334'/>
-    <qualified-type-def type-id='type-id-21' const='yes' hash='8f60dd2f0b8834b6' id='type-id-335'/>
-    <pointer-type-def type-id='type-id-335' size-in-bits='64' hash='7da4750c0c4a7ea5' id='type-id-336'/>
-    <pointer-type-def type-id='type-id-336' size-in-bits='64' hash='fd89690d624a6590' id='type-id-337'/>
-    <pointer-type-def type-id='type-id-323' size-in-bits='64' hash='211a43ae952a7dc8' id='type-id-338'/>
-    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='de702e35ca2a7687' id='type-id-324'/>
-    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-339'/>
-    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='bd1d889facccead8' id='type-id-340'/>
-    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-198'/>
-    <pointer-type-def type-id='type-id-198' size-in-bits='64' hash='af4ac49f7abe50c2' id='type-id-341'/>
-    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-344'/>
-    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-345'/>
-    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc' hash='2d54aef0745cb1f9'>
-      <return type-id='type-id-337'/>
-    </function-decl>
-    <typedef-decl name='DIR' type-id='type-id-344' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-342'/>
-    <var-decl name='stdout' type-id='type-id-85' visibility='default' filepath='/usr/include/stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
-    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
-      <parameter type-id='type-id-85'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
-    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen64' hash='6347265fef1b547c'>
-      <parameter type-id='type-id-94'/>
-      <parameter type-id='type-id-94'/>
-      <return type-id='type-id-85'/>
-    </function-decl>
-    <function-decl name='fread' filepath='/usr/include/stdio.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='b41d7fe688a81bb5'>
-      <parameter type-id='type-id-345'/>
-      <parameter type-id='type-id-82'/>
-      <parameter type-id='type-id-82'/>
-      <parameter type-id='type-id-332'/>
-      <return type-id='type-id-82'/>
-    </function-decl>
-    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno' hash='5ac3795bb1331787'>
-      <parameter type-id='type-id-85'/>
-      <return type-id='type-id-13'/>
-    </function-decl>
+    <qualified-type-def type-id='type-id-84' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-331'/>
+    <qualified-type-def type-id='type-id-80' const='yes' hash='645f4d0d44563fc6' id='type-id-332'/>
+    <pointer-type-def type-id='type-id-332' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-333'/>
+    <qualified-type-def type-id='type-id-21' const='yes' hash='8f60dd2f0b8834b6' id='type-id-334'/>
+    <pointer-type-def type-id='type-id-334' size-in-bits='64' hash='7da4750c0c4a7ea5' id='type-id-335'/>
+    <pointer-type-def type-id='type-id-335' size-in-bits='64' hash='fd89690d624a6590' id='type-id-336'/>
+    <pointer-type-def type-id='type-id-322' size-in-bits='64' hash='211a43ae952a7dc8' id='type-id-337'/>
+    <pointer-type-def type-id='type-id-189' size-in-bits='64' hash='de702e35ca2a7687' id='type-id-323'/>
+    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-338'/>
+    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='bd1d889facccead8' id='type-id-339'/>
+    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-197'/>
+    <pointer-type-def type-id='type-id-197' size-in-bits='64' hash='af4ac49f7abe50c2' id='type-id-340'/>
+    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-343'/>
+    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-344'/>
